[
  {
    "id": "calgary-sunridge-justin-lalonde",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Justin Lalonde",
    "trainerNumber": 1,
    "name": "Justin Lalonde",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/explore/trainers/sunridge_trainers/Justin.jpg",
    "bio": "Formerly a fine dining chef in the heart of Ottawa, I transitioned into the fitness industry almost 3 years ago. This transition occurred due to my simple love of sport. Before beginning my career as a strength and conditioning coach, I played lacrosse at the Junior B level and competed nationally in track & field as a 400m sprinter. Fast forward a few years to when I discovered the sport of OCR (obstacle course racing). Dedicating the last few years OCR I am now competing at the elite level and have competed in the 2019 Spartan Race World Championships & 2022 OCR World Championships.\nThrough my own journey, I have discovered we are truly all capable of greatness. I have a mission to help others discover their true potential and an understanding behind the process and benefits of intentional training.\nMy philosophy therefore is to train every aspect of the human body; from strength to the metabolic energy systems, all while placing a huge emphasis on mobility, stability and recovery.",
    "areas_of_focus": "Strength & Conditioning, Pain free Performance/Movement, Hypertrophy, Mobility",
    "certification": "Can-Fit Pro, PPSC: Pain Free Performance Specialist",
    "email": "jlalo078@uottawa.ca",
    "phone": "613-818-8767",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-mark-austin",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Mark Austin",
    "trainerNumber": 2,
    "name": "Mark Austin",
    "role": "Physiotherapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/explore/trainers/sunridge_trainers/Mark-Austin-1.jpg",
    "bio": "Prior\nto his clinical work, he worked in a research lab dedicated to\nneurorehabilitation, which has given him a strong passion for science-informed\ncare. He has contributed to numerous scientific publications that have been\ncited hundreds of times in various peer-reviewed journals.\n– Canadian Yoga Alliance 200-hour\nCertified Yoga Teacher\n– SMART Seminars\nBioMedical\nDry Needling Level 1 and 2\n– Advanced Certified Manual Therapist –\nSwodeam\nInstitute Spinal Series 1 and 2\n– SHIFT Concussion Management Program Level 1\n– Selective Functional Movement Assessment Level 1\n– Robin McKenzie Institute of Canada – Parts A and B\n– Orthopaedic Division of the CPA – Level 1\n– Acupuncture Canada Foundations of Anatomical Acupuncture – Level 1",
    "areas_of_focus": "His\nclinical experience has included managing major traumatic and complex injuries\nfrom the Alberta oilsands; high-level athletes and sports teams; people with\nconcussion, brain injury, stroke, multiple sclerosis and Parkinson's disease;\npre- and post-operative patients; motor vehicle accident injuries; older adults\nlooking to maintain their independence; and everyday people from all walks of\nlife including CEOs, blue- and white-collar employees, weekend warriors and\nstay-at-home moms.",
    "certification": "Certifications, – ACE-certified Behaviour Change\nSpecialist",
    "email": "mark@physiobox.ca",
    "phone": "403-483-5838",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-brielle-ferguson",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Brielle Ferguson",
    "trainerNumber": 3,
    "name": "Brielle Ferguson",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/03/Brielle-Ferguson-.jpg",
    "bio": "Brielle is a young dedicated professional graduating in 2024 with a Bachelor's in Health and Physical Education, specializing in Physical Literacy Studies. With an impressive decade-long journey in junior provincial-level volleyball, and spending five years in both provincial and university-level rugby, she has learned and practiced valuable leadership skills. Currently, she is a weightlifter, personal trainer, and coach, holding an NCCP certification in weightlifting and is a proud member of CSEP. Brielle's passion lies in guiding individuals to achieve their fitness aspirations, with a focus on developing physical literacy skills and fostering strength and conditioning in sports like weightlifting, rugby, and volleyball.,",
    "areas_of_focus": "Olympic weightlifting coaching, Sports performance: Rugby & Wrestling, Youth Athlete Development, Physical Literacy, Injury Prevention",
    "certification": "Bachelor of Health and Physical Education (BHPED), CSEP Certified Personal Trainer (CSEP-CPT), NCCP Olympic Weightlifting Coach Certified",
    "email": "bferg152@mtroyal.ca",
    "phone": "(587) 973-2516",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-josh-strate",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Josh Strate",
    "trainerNumber": 4,
    "name": "Josh Strate",
    "role": "Personal Trainer & Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/04/Josh-Strate-1.jpg",
    "bio": "Josh has been a trainer/coach in the fitness industry since 2011. Starting his career he trained/coached MMA, kickboxing and Muay Thai fighters to become high performing athletes. Being an MMA and Muay Thai fighter himself he was able to understand where his athletes needed to be when getting ready to compete.\nLater in his career, Josh's thirst for knowledge led him to pursuing a new career as an Registered Massage Therapist. He has been practicing as a RMT since early 2019. This change in Josh's career has not only increased his knowledge of the body drastically but has also made him a better Personal Trainer because of it. This has led him to specializing in rehabilitation of chronic and acute injuries as well as the transition from rehab back to activity. Josh believes that everyone at any stage in life, athlete or just starting your fitness journey, should strive to live a pain free life.\nJosh is a huge believer in continued education. When Josh isn't helping people become the best they can, he is either working on new courses or doing his own research so he can become a better Personal Trainer and RMT.",
    "areas_of_focus": "Movement & Performance Therapy, Pain-Free Performance, Rehabilitation, Postural Correction, Mobility Training, Strength Training, Dynamic Cupping",
    "certification": "ASFA Personal Trainer Certification, Movement & Performance Therapy Specialist, Pain-Free Performance Specialist, Mobility Fundamentals for Prehab and Performance, TFC (The Foot Collective) Seminars, Registered Massage Therapist, ACMT Massage Therapy 2200 Hour Diploma, Certified SFH Dynamic Cupping Therapist, Dynamic Cupping Massage, Manual Lymphatic Drainage",
    "email": "strateupfitness@gmail.com",
    "phone": "403-999-3976",
    "social_links": ["https://www.instagram.com/strateupfitness/"]
  },
  {
    "id": "calgary-sunridge-jessica-leemans",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Jessica Leemans",
    "trainerNumber": 5,
    "name": "Jessica Leemans",
    "role": "PERSONAL TRAINER",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2020/06/Jessica-Leemans-1.jpg",
    "bio": "Jessica Leemans is a Strength and\nConditioning Coach specializing in injury prevention and rehabilitation. She\nwas a two sport NCAA DI athlete, has pursued an undergraduate, two master's\ndegrees and due to results in key performance indicators and her injury\nprevention work has most recently been brought in to complete her Doctorate in\nElite Performance.",
    "areas_of_focus": null,
    "certification": null,
    "email": "coachleemans@gmail.com",
    "phone": "403-988-0784",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-myles-stetch",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Myles Stetch",
    "trainerNumber": 6,
    "name": "Myles Stetch",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2020/09/Myles-1.jpg",
    "bio": "Myles has been a certified Personal Trainer since 2013. His area of expertise is in Pain-free Performance, guiding his clients through exercise programs that avoid injuries while improving their strength. If you want to be able to push, pull, carry, squat, deadlift and lunge with great strength and virtually no pain, Myles is the ideal trainer for you. Online training is also available.",
    "areas_of_focus": "– Pain-free Performance – TRX – Hypertrophy – Strength – Technique Training, ",
    "certification": "– PPSC: Pain-free Performance Specialist – Eleiko Olympic Weightlifting and Powerlifting Certified – Darby Training Systems Low Back Specialist Certified – Mobility WOD Level 1 Certified – TRX Suspension Training Course",
    "email": "mstetch@gmail.com",
    "phone": "403-988-8601",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-rogan-reid",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Rogan Reid",
    "trainerNumber": 7,
    "name": "Rogan Reid",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2020/11/ROGAN-REID.jpg",
    "bio": "Rogan started his athletic career and in the fitness industry at the age of 10 in the sport of Ski Jumping. He competed in Canada, the US and across Europe in multiple Jr. World Championships & National championships.\nRogan has been involved in coaching for more than 10 years. As a former elite athlete, and current Olympic Weightlifting athlete, he is always striving to learn more about strength and fitness to get the best out of his clients, and give them the best service he can deliver.\nHe is passionate about strength, fitness & health, and is always trying to put the same love and passion he has for the gym into his client's hearts. He takes joy in teaching his clients how to move properly and avoid injury while leading them to achieve their fitness goals. Rogan brings his high energy personality to every training session and ensures his clients leave feeling like they have worked their best and are on the right path to achieve their goals after every session.",
    "areas_of_focus": null,
    "certification": null,
    "email": "coach@grtr.fitness",
    "phone": "587-229-4001",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-carly-marinos",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Carly Marinos",
    "trainerNumber": 8,
    "name": "Carly Marinos",
    "role": null,
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2025/03/Carly-Marinos.jpg",
    "bio": "Carly graduated from Alberta College of Massage Therapy 2200 hour RMT diploma program and has been a massage therapist since 2017.\nIn 2020 she started focusing on the pelvic floor and women's health. Carly is certified in Pelvic Floor Exercise, Core Confidence Training, Fertility, Pregnancy, and Postpartum Massage and Corrective Exercise.\nCarly is also certified in Dynamic Cupping, Fascial Decompression, Myofascial Release and Lymphatic Drainage. Helping people after surgeries, with tension, and reducing swelling in general.",
    "areas_of_focus": "Pelvic Floor, Myofascial Decompression & Release, Lymphatic Drainage",
    "certification": "Birth & Postpartum Doula, Reiki Master, Pregnancy & Postpartum Corrective Exercise Specialist, Fascial Decompression & Myofascial Release Certified, Lymphatic Drainage",
    "email": null,
    "phone": null,
    "social_links": []
  },
  {
    "id": "calgary-sunridge-jasmine-hwangbo",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Jasmine Hwangbo",
    "trainerNumber": 9,
    "name": "Jasmine Hwangbo",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/03/Jasmine.jpg",
    "bio": "Jasmine is a registered massage therapist based in Calgary, AB. She graduated from Mohawk College in Hamilton, Ontario with an Advanced diploma in Massage Therapy. Jasmine enjoys finding the perfect balance between relaxation and therapeutic massage techniques, and is skilled in using Myofascial cupping, Graston, and active release therapy techniques.\nJasmine is known for her willingness to educate her clients on their condition/injury. She understands that life can be challenging and works with her clients to develop realistic steps towards their goals. She values the opportunity to meet clients from all backgrounds, and enjoys being part of their wellness journey. Taking the time to understand her clients' concerns, experience, and history with their body, and uses palpation and range of motion testing to better direct their treatment.\nThrough her treatments, Jasmine aims to provide a sense of relief and freedom from tension, stress, and pain. She is committed to helping her clients achieve their goals, whether it be movement/performance-based or a feel-good chase. In her pursuit of continued growth and education, Jasmine regularly seeks out advice from colleagues and mentors, and takes continuing education courses to stay up to date on the latest techniques and research in the field of wellness.",
    "areas_of_focus": "Chronic pain, Tension and stress relief, Strains, Exercise rehab, Headaches, Low back pain/sciatica",
    "certification": "Mohawk College – Advanced Diploma in Massage Therapy",
    "email": "thrivemassagetherapyyc@gmail.com",
    "phone": null,
    "social_links": ["https://www.instagram.com/thrivemassagetherapyyc/"]
  },
  {
    "id": "calgary-sunridge-brett-hansen",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Brett Hansen",
    "trainerNumber": 10,
    "name": "Brett Hansen",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2019/06/Brett-Hansen_c50190cd2d4932376ac34c38f2ced1a6.jpg",
    "bio": "Losing my Dad in 2005 to cancer sparked a fire inside me to help others be ready to step up to help in all unforeseen times of need. By building the habit of proper training and maintaining a healthy and active lifestyle, we will be ever ready to answer the call. My goal is to build a TEAM full of people of all walks of life who are PASSIONATE about answering that call!",
    "areas_of_focus": "– Strength and Conditioning – Hypertrophy – Body Composition – Habit Building – Creating Tougher Humans",
    "certification": "– Poliquin Level 1 – Precision Nutrition Level 1",
    "email": "thehulkhansen@gmail.com",
    "phone": "1-587-899-5181",
    "social_links": [
      "https://www.instagram.com/thehulkhansen/",
      "https://teamhulk.ca/"
    ]
  },
  {
    "id": "calgary-sunridge-dan-balsom",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Dan Balsom",
    "trainerNumber": 11,
    "name": "Dan Balsom",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2020/08/DAN-BALSOM-1.jpg",
    "bio": "Dan Balsom hails from England, where he was exposed to a variety of sports and life experiences, which all led him to eventually find his true career passion as a Sports Performance Coach.\nIn his youth he swam competitively for 9 years, while playing soccer from youth level, up to representing his University in England for 3 years. During his years at the University of East Anglia, Dan gained a Law degree and then a Masters in Marketing. The key factors behind his decision to become a Sports Performance Coach, being the opportunity of a profession filled with helping athletes and clients achieve their dreams and reach sporting levels which he himself had aspired to.\nSince joining the industry in 2013, his experience has included the following:\n-Worked with national and professional athletes in multiple sports, as well as grassroots athletes as young as 7.\n-Currently completing a Doctorate in Elite Performance, specializing in agility.\n-5+ years mentoring and developing coaches.\n-Experience in many complex rehabilitations related to back, knee, hip, shoulder and many other injuries.\n-Overseen the performance programs of major sports organizations in soccer, basketball, hockey and football.",
    "areas_of_focus": null,
    "certification": null,
    "email": "dan@balsom-sp.com",
    "phone": "403-966-2886",
    "social_links": []
  },
  {
    "id": "calgary-sunridge-josh-diesel",
    "location": "CALGARY SUNRIDGE",
    "trainerName": "Josh Diesel",
    "trainerNumber": 12,
    "name": "Josh Diesel",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2020/08/Josh-1.jpg",
    "bio": "Josh Diesel is the Head Coach of Valhalla Strength, a Club that specializes in Olympic Weightlifting, Powerlifting, Sport Development, and Bodybuilding. He has been in the fitness industry for 15 years.\nAs an athlete, Josh competed in Olympic Weightlifting for 8 years, and has multiple Provincial and Westerns Gold Medals, as well as a Bronze and Silver at Nationals. He also holds the +105kg Provincial Records in Snatch, Clean and Jerk, and Total (153kg, 187kg, and 340kg respectively). As a coach, his athletes hold multiple Provincial and Westerns Medals and Best Lifter Awards, Bronze and Silver at Nationals, and held Provincial records in their weight classes. He has developed athletes up from novice to competing internationally for Team Canada.\nHe works with athletes of all levels and abilities and is passionate about working with people dedicated to improving themselves physically and mentally.\nCredentials:\nNCCP Competition Introduction Certified\nChek\nInstitute Core and Back Certified",
    "areas_of_focus": null,
    "certification": null,
    "email": "trainer.jm@gmail.com",
    "phone": "403-966-7380",
    "social_links": ["https://www.instagram.com/coachjoshdiesel/?hl=en"]
  }
]
