[
  {
    "id": "calgary-seton-luisa-garcia",
    "location": "CALGARY SETON",
    "trainerName": "Luisa Garcia",
    "trainerNumber": 1,
    "name": "Luisa Garcia",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/08/Luisa-Garcia-1.jpg",
    "bio": "Luisa has been in the industry since 2019. through her own experiences with mental health, hardships and being a Mother; she has learned one thing-Despite any obstacles you are capable of taking action, which will give you the confidence to change your life.\nLuisa wants to help as many people as possible achieve this change, so you can see just how incredible you truly are.",
    "areas_of_focus": "Making moms strong, General strength training, Lifestyle change/Transformation, Weight loss, Injury prevention training",
    "certification": ", Mount Royal University Personal Fitness   Trainer – Diploma, CSEP- PT certification",
    "email": null,
    "phone": "403-629-6875",
    "social_links": ["https://www.instagram.com/limitlessfitness.health/"]
  },
  {
    "id": "calgary-seton-henrik-kovacs",
    "location": "CALGARY SETON",
    "trainerName": "Henrik Kovacs",
    "trainerNumber": 2,
    "name": "Henrik Kovacs",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2021/12/Henrik-Kovacs.jpg",
    "bio": "My name is Henrik and I have been a Certified Personal Trainer since 2014. Over the years I have had the opportunity to help many people from all walks of life challenge their athletic, fitness, and health goals. I believe that strength training and proper nutrition are keys to opening up new doors and opportunities in life that lead you to living and moving with more confidence and competence; whether that be on the field, at work, or while doing your favorite hobby.",
    "areas_of_focus": "Injury Reduction, Strength, Nutrition",
    "certification": ", Degree in Health and Physical Education, Major in Physical Literacy, ISSA-Certified Personal Trainer, Precision Nutrition-L1 Nutrition Coach",
    "email": "hkova.training@gmail.com",
    "phone": "403-771-0370",
    "social_links": ["https://www.instagram.com/hkova_94/"]
  },
  {
    "id": "calgary-seton-julia-shelley",
    "location": "CALGARY SETON",
    "trainerName": "Julia Shelley",
    "trainerNumber": 3,
    "name": "Julia Shelley",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/02/Julia-Shelley.jpg",
    "bio": "Certified Personal Trainer since 2010, I’m Julia Shelley, professional fitness competitor, sponsored athlete and 2019 North American Pro Fitness Champion. With over a decade of experience, I specialize in strength training, body composition, fat loss, hypertrophy, high-intensity interval training, mobility and macronutrients. Each session with me is tailored to the individual’s needs, whether they’re new to the gym or seasoned athletes looking to push their limits.",
    "areas_of_focus": "Fat Loss, Body Composition, Strength, Mobility, Hypertrophy and HIIT",
    "certification": ", CanFit Pro Personal Training Specialist, Precision Nutrition Level 1 & 2, Certified Yoga Instructor YTT400 hrs, Tony Boutagy’s Advanced Program Mastery",
    "email": "juliashelleyfit@gmail.com",
    "phone": null,
    "social_links": [
      "http://www.armyofangels.ca",
      "https://www.instagram.com/juliashelley/?hl=en"
    ]
  },
  {
    "id": "calgary-seton-kelly-newman",
    "location": "CALGARY SETON",
    "trainerName": "Kelly Newman",
    "trainerNumber": 4,
    "name": "Kelly Newman",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/09/Kelly-Newman.jpg",
    "bio": "Kelly is a certified personal trainer, coach, and yoga instructor. She has a unique knack for meeting clients where they are at and inspiring them to stay connected to their goals. She has helped her clients transform their bodies and their lives by helping them integrate movement, nutrition, sleep, and stress management in their lifestyles. Her definition of fitness has evolved over the years from physical aesthetics and performance to honoring one’s physical and mental health. She helps her clients create routines that allow them to thrive within their lives. As a lover of hiking, skiing, biking and anything adventurous, she believes in making fitness fun. “Move your body, use it every way you can. Don’t be afraid of it or what other people think of it, it is the greatest instrument you will ever own.” Baz Luhrmann",
    "areas_of_focus": "Weight Loss and mobility, Weight and stress management, Performance training for athletes, Group training for athletes",
    "certification": "Certified Personal Trainer (Mount Royal University), Certified Pain Free Performance Specialist, 200 Hour Yoga Teacher Training, NCCP Level 2 Gymnastics Coach, Certification for Stress, Anxiety, and Self-Regulation",
    "email": "Kellyofitness@yahoo.ca",
    "phone": "403-615-8509",
    "social_links": []
  },
  {
    "id": "calgary-seton-lee-gye-pt-intern",
    "location": "CALGARY SETON",
    "trainerName": "Lee Gye, PT Intern",
    "trainerNumber": 5,
    "name": "Lee Gye, PT Intern",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/01/Lee-Gye.jpg",
    "bio": "Originally from coastal BC, Lee is a former soccer player and avid gym-goer. Lee uses an individualized and active approach to empower people of all ages and abilities to move better and perform better. Lee is involved in the Calgary rugby scene and knows what it takes to help others return from a multitude of sport-related injuries. Lee holds a Bachelor of Human Kinetics with Specialization in Clinical Exercise Physiology from the University of British Columbia Okanagan and a Master of Science in Physiotherapy from Glasgow Caledonian University. Provisionally licensed by the College of Physiotherapists of Alberta, Lee believes in finding and fixing the root cause of pain to get people back to doing the things that they love.",
    "areas_of_focus": null,
    "certification": ", Certified Strength & Conditioning Specialist, NSCA, Sport First Responder, Canadian Red Cross, SportMedBC Athletic Taping",
    "email": "lee@fulcrumphysiotherapy.com",
    "phone": "403 808 6319",
    "social_links": [
      "https://www.instagram.com/fulcrum.physio/?hl=en",
      "https://www.fulcrumphysiotherapy.com/"
    ]
  },
  {
    "id": "calgary-seton-colin-urquhart",
    "location": "CALGARY SETON",
    "trainerName": "Colin Urquhart",
    "trainerNumber": 6,
    "name": "Colin Urquhart",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/01/Colin-Urquhart-.jpg",
    "bio": "Colin Urquhart has been a personal trainer since 2015, and a CrossFit coach since 2018. Colin has been working with athletes in the hockey community for over 10 years and comes from an extensive athletic background playing junior level hockey and football. He is currently a nationally ranked Olympic weightlifter and a high-level competitive CrossFit athlete.\nHe educates his clients on the importance of living a healthy and active lifestyle that goes hand-in-hand with everyday functional movement. Functional movements and the importance of making healthy changes to help build good habits will lead to improving the quality of life for all.\nColin has experience in working with general weight loss clients, high level nationally ranked athletes, junior and collegiate hockey players, and works closely with professional athletes on a daily basis.",
    "areas_of_focus": "Strength and Conditioning, Olympic Weightlifting, Sports Specific Training, Weight Loss, Injury Prevention and Rehabilitation",
    "certification": ", ELA Personal FitnNCCP Level 1 Competition Olympic Weightlifting Coach, CrossFit Level 1 Trainer, NCCP Multi Sport Coach, NCCP Respect in Sport (Calgary Royals hockey), NCCP Trained Athletics Coach",
    "email": null,
    "phone": "403-875-9792",
    "social_links": ["https://www.instagram.com/the_urqs/"]
  },
  {
    "id": "calgary-seton-pauline-cound",
    "location": "CALGARY SETON",
    "trainerName": "Pauline Cound",
    "trainerNumber": 7,
    "name": "Pauline Cound",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/Paulines.jpg",
    "bio": "With a specialization in training older adults, Pauline Cound is an expert in working with seniors in both one-on-one and group settings, with a focus on functional movement. Her group classes are intentionally limited in size to ensure safety and the ability to adapt exercises to address individual limitations. As an AFLCA-certified trainer with specialized courses from the FAI and CETI related to exercise for arthritis, joint replacement, and cancer, Pauline creates engaging classes that enhance fitness, mobility, and strength for those aged sixty and over. In addition to her work with seniors, Pauline boasts a professional and elite athletic background in multiple sports, including field hockey, triathlon, and cycling. She earned the Masters World Road Cycling Champion title for Women 50+, and continues to coach swimming, cycling, and triathlon. Pauline&#39;s extensive professional qualifications include teaching and serving as the",
    "areas_of_focus": "Mature Adult Group Functional Fitness, Strength Classes",
    "certification": ", ISSA Certified Personal Trainer, CPR First Aid",
    "email": "Plcound@icloud.com",
    "phone": null,
    "social_links": []
  },
  {
    "id": "calgary-seton-dr-sebastien-desouza",
    "location": "CALGARY SETON",
    "trainerName": "Dr. Sebastien DeSouza",
    "trainerNumber": 8,
    "name": "Dr. Sebastien DeSouza",
    "role": "Chiropractor",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/09/Dr.-Sebastien-DeSouza.jpg",
    "bio": "Dr. Sebastien has always been passionate about sport and exercise. He grew up playing hockey and snowboarding, and the multitude of associated injuries with ensuing rehabilitation led him to study kinesiology at Queen’s University. While there, he worked as a student athletic therapist for the varsity hockey team, collaborating with various healthcare practitioners to improve the health and performance of high-level athletes.\nDr. Sebastien’s experiences were a natural transition to chiropractic; he pursued his Doctor of Chiropractic at the Canadian Memorial Chiropractic College, where he graduated Summa Cum Laude. He has worked with athletes of all levels, pre- and post-surgical patients, and individuals living with chronic pain. He uses an evidence-based, goal-oriented approach to help his patients become the best version of themselves.\nAfter moving frequently throughout his life, Dr. Sebastien is happy to call Calgary his new home. When he’s not in the clinic, he can be found enjoying the mountains, playing hockey, and fumbling around on a guitar.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Bachelor of Science in Honours Physiology, Master of Science in Physical Therapy",
    "email": "seb@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/dr.sebastiendesouza/"
    ]
  },
  {
    "id": "calgary-seton-ethan-christensen",
    "location": "CALGARY SETON",
    "trainerName": "Ethan Christensen",
    "trainerNumber": 9,
    "name": "Ethan Christensen",
    "role": "Massage THerapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Ethan-Christensen.jpg",
    "bio": "Ethan Christensen is a Registered Massage Therapist with a diploma in Massage Therapy from Makami College. Born and raised in the sunny Okanagan Valley, he grew up with an appreciation for an active lifestyle through his natural surroundings and his participation in competitive sports. Ethan played hockey throughout his years of school until he eventually made the change to Ultimate Frisbee, where he now plays for the Alberta men’s team.\nThroughout his years as an athlete, Ethan became acutely aware of the importance that physical health plays in competition. This interest in improving his own performance, and preventing game hindering injuries, lead him to pursue a career in massage. In his practice he aims to empower his patients with education to prevent injuries and perform at their best— no matter the activity. Outside of work, you can find Ethan throwing a frisbee around or discussing bee conservation.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Registered Massage Therapist",
    "email": "ethan@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/ethan_dynamic/"
    ]
  },
  {
    "id": "calgary-seton-gino-suarez",
    "location": "CALGARY SETON",
    "trainerName": "Gino Suarez",
    "trainerNumber": 10,
    "name": "Gino Suarez",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/04/Gino-Suarez.jpg",
    "bio": "My training philosophy is about mastering the basics. I believe that building a solid foundation and educating each client through the process will provide long term success and self efficacy.\nHaving coached trainers across Canada, I take the same approach to when I’m coaching 1 on 1 clients or remote clients. Whether its strength, mobility or nutrition, educating each individual on the task given is crucial to achieving results.",
    "areas_of_focus": "General Strength, Injury / Rehab Training, Hypertrophy Training, Nutrition Coaching, Remote Coaching",
    "certification": ", Pre-Script Level 2 Coach, Pre-Script Skill Acquisition, Precision Nutrition Level 1 Coach, Functional Range Conditioning Mobility Specialist",
    "email": "info@ginosuarez.com",
    "phone": "204-230-7011",
    "social_links": [
      "http://www.ginosuarez.com",
      "https://www.instagram.com/ginosuarez/?hl=en"
    ]
  },
  {
    "id": "calgary-seton-jacquie-strom",
    "location": "CALGARY SETON",
    "trainerName": "Jacquie Strom",
    "trainerNumber": 11,
    "name": "Jacquie Strom",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/04/jaquiephoto-1.jpg",
    "bio": "I’m Jacquie, a mom of four who understands the whirlwind of balancing fitness and family life. I’m here to guide you through it all, from core and pelvic health to joint care, osteoporosis, and nutrition coaching. With a background in education and a love for teaching, I’m dedicated to helping you learn and feel empowered in your health journey. The human body is amazing, and I’m here to help you rediscover all that yours can do.",
    "areas_of_focus": "General Strength & Conditioning, Post-rehabilitation, Core & Pelvic Floor, Osteoporosis, Nutrition Coaching",
    "certification": ", Certified Personal Trainer (CanfitPro), Certified Nutrition Coach (NASM), Postpartum Corrective Exercise Specialist (Core Exercise Solutions), BoneFit Certified (Osteoporosis Canada)",
    "email": "jacquie@oncorefitness.ca",
    "phone": "403-354-6955",
    "social_links": [
      "https://www.instagram.com/oncorefitness.ca",
      "https://oncorefitness.ca/"
    ]
  },
  {
    "id": "calgary-seton-sharon-damen",
    "location": "CALGARY SETON",
    "trainerName": "Sharon Damen",
    "trainerNumber": 12,
    "name": "Sharon Damen",
    "role": "Laser Technician",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/04/Sharon-Damen.jpg",
    "bio": "Sharon is the owner/operator of Summit Laser Studio. She began her career as a laser technician in 2015 after completing the clinical esthetics program at Delmar College. She chose to focus completely on laser hair removal and photo rejuvenation. Her favorite part of the job is getting to know the clients as she takes them through their personalized treatment plan. Making them feel comfortable and safe is just as important to her as offering an effective treatment at a reasonable price.",
    "areas_of_focus": "Laser hair removal, Photofacials, Sunspots, Vascular lesions, Rosacea",
    "certification": ", Clinical esthetics – Delmar College, IPL – Delmar College, Alexandrite laser – Cynosure, nd:Yag laser – Cynosure",
    "email": "sharon@summitlaserstudio.com",
    "phone": "403-472-5251",
    "social_links": []
  },
  {
    "id": "calgary-seton-aldain-griffiths",
    "location": "CALGARY SETON",
    "trainerName": "Aldain Griffiths",
    "trainerNumber": 13,
    "name": "Aldain Griffiths",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/08/Untitled-1cxxz.jpg",
    "bio": "My name is Aldain Griffiths but my clients and athletes call me Coach Al, I have been a personal trainer and coach for over 13 years. My love for fitness started back when I was taking my first bachelor’s of science in the US. Tho, my love for fitness originates from the Army where I did 3 tours, my training style is far from it. Unless it is your preference, our sessions will not be one of a “boot camp” style. My approach to our sessions will be clinical, precise and relevant to your goals. Your goals and comfort are my priority. So, why work with me? What can I do for you? Honestly, I know that my passion for fitness, knowledge and helping people with my expertise will benefit you because I’m simply obsessed with the fulfillment I get when my clients are not only satisfied but have broken through barriers they didn’t even know existed! I am confident that I will give you 110% of my effort in each session and when you have those days where you only have enough motivation to show up at the gym, I will be motivated enough for the both of us! Let’s crush those goals and leave the doubts in the past!",
    "areas_of_focus": "Strength development, Body Composition, Post injury corrective exercise, Movement technique and development, Weight loss and Sport Specific Training",
    "certification": ", US Dept Of Defence: Recruit Physical readiness instructor, NASM: Strength and conditioning, NASM: Corrective Exercise, NASM: Exercise Psychology,, NASM: Sport Specific Instructor, NASM: Group Instruction, ISSA Personal Training",
    "email": "Coachalfitness@gmail.com",
    "phone": "780-285-5074",
    "social_links": ["https://www.instagram.com/coach_aldain/"]
  },
  {
    "id": "calgary-seton-chris-lemky",
    "location": "CALGARY SETON",
    "trainerName": "Chris Lemky",
    "trainerNumber": 14,
    "name": "Chris Lemky",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/02/Chris.jpg",
    "bio": "Perfectionists are hard to have around, although often they are necessary. Chris Lemky is no exception. Unwilling to compromise, impossible to bargain with and generally disagreeable. If you have ever had a feeling or emotion: stay at least 10 meters away from this man. Getting coached by Chris is an absolute last resort. Some examples of reasonable motivation to bring this nemesis into your life are:\nOutside of similar parameters, the surgeon general does not recommend consuming this product. Coaching from Chris is comparable to eating liver; you know it’s good for you, highly nutritious and makes you superior to those around you… but the irony blood taste and the horrible mouthfeel make it almost not worth it. He is quoted as saying:\n“Anything that is against the Geneva Convention is a great coaching technique.”\n-MG\n“You just do this to upset me!”\n-SK\n“What do you know, you’re just a weightlifting coach.”\n-EE\n“They’re just feelings, they’ll heal.”\n-RS\n“I’m much stronger, but I’m so depressed.”\n-MG\n“I just F—k-ng HATE this!” **throws belt**\n-CU\n**Crying/sobbing in public**\n-Unknown",
    "areas_of_focus": null,
    "certification": ", “I hate your guts, but god damn do I respect you.”",
    "email": "Info@frontierperformance.ca",
    "phone": null,
    "social_links": ["https://www.instagram.com/frontierperformance/"]
  },
  {
    "id": "calgary-seton-vicky-lasenzaniro",
    "location": "CALGARY SETON",
    "trainerName": "Vicky Lasenzaniro",
    "trainerNumber": 15,
    "name": "Vicky Lasenzaniro",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/vickys.jpg",
    "bio": "Vicky became a trainer after struggling with declining health and joint function from working in an office environment. She hired a trainer and pursued the education that would allow her to free people from the same issues. After having resolved her own shoulder, back, hip, and knee issues, she has a unique perspective on what it takes to regain function.\nDuring this time she discovered powerlifting and fell in love with building strength and testing her limits. Vicky has competed at a National level and coaches a team of athletes in the CPU. Being a competitive powerlifter has taught Vicky how to apply exercises to free people from limitations and perform their best.",
    "areas_of_focus": "Competitive Powerlifting, Biomechanics-based strength training, Joint function and strengthening, Strength Sport, Fitness for Office Workers",
    "certification": ", Personal Trainer Diploma (ELA), American Council on Exercise (ACE) Personal Training Certification, IFH Powerlifting, Olympic Lifting, and Kettlebell, ACE Orthopedic Exercise Specialist, Functional Range Conditioning (FRC)",
    "email": "vix.coaching@mibz.ca",
    "phone": "403-827-2165",
    "social_links": ["https://www.instagram.com/vix.strength.performance/"]
  },
  {
    "id": "calgary-seton-laura-mora",
    "location": "CALGARY SETON",
    "trainerName": "Laura Mora",
    "trainerNumber": 16,
    "name": "Laura Mora",
    "role": "Medical Aesthetician and Advanced Laser Technician",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/02/Untitled-1vvc.jpg",
    "bio": "Meet Laura Mora, the passionate force behind Renew Glow Laser. As a skilled Medical Aesthetician and Advanced Laser Technician over 19 years Laura brings expertise and dedication to every client she serves. Her commitment to skincare excellence is evident in her mastery of cutting-edge techniques and state-of-the-art equipment, including Sciton Lasers like Moxi and BBL Forever Young, Bareit and innovative technologies like EXION by BTL. Laura’s personalized approach ensures each individual receives tailored treatments for their unique needs. With services focus on skin health maintenance like HydrafacialMD, Oxygeneo, Dermabrasions, facials and medical peels to advanced correction technologies like Sciton Lasers and BTL age reversal technologies, Laura is dedicated to helping clients achieve radiant, youthful, healthy skin. Experience the difference with Laura Mora at Renew Glow Laser, where beauty meets innovation.",
    "areas_of_focus": "Laser Hair Removal – Bare it, BBL Forever Young & BBL Forever Clear, MOXI resurfacing, Sun spots / Hyperpigmentation face and Body, Vascular Conditions / Rosacea and Broken Vessels, Body Contouring and Fat reduction, Skin Health Maintenance (facials + Peels)",
    "certification": null,
    "email": "renewglowlaser@hotmail.com",
    "phone": "403-466-3738",
    "social_links": ["http://www.vagaro.com/renewglowlaser"]
  },
  {
    "id": "calgary-seton-matthew-fordham",
    "location": "CALGARY SETON",
    "trainerName": "Matthew Fordham",
    "trainerNumber": 17,
    "name": "Matthew Fordham",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/04/Matthew-Fordham.jpg",
    "bio": "I specialize in deep tissue therapeutic treatments. Although I particularly enjoy treating athletes, the reality is that we all have areas that need work. Most of us do far too much sitting for work (or on the couch) which can lead to aches and pains. A specialized deep tissue treatment plan can alleviate chronic upper back and neck pain as well as tension headaches and migraines. Throughout our treatment plan, I will utilize a variety of techniques and modalities to achieve the desired results.\nPerhaps you’re an athlete who wants to improve your athletic performance. Or you’ve realized you just worked a little too hard in the gym. Or maybe it’s the aches and pains of everyday life that have you feeling pushed into the corner. Whatever your situation and the reasons for it, I will tailor a unique plan for your specific needs",
    "areas_of_focus": "Deep Tissue, Sports Massage, Acute injury pain, Whiplash injuries, Chronic Pain, Carpal tunnel syndrome, Tennis/golfers elbow, SI dysfunction, Migraines, TMJ dysfunction, Postural Correction, Educating patients",
    "certification": ", Bachelors of Kinesiology Degree (2006), Registered Massage Therapist (2017)",
    "email": "fordhamrmt@gmail.com",
    "phone": "403-803-5289",
    "social_links": [
      "http://www.fordhammassagetherapy.ca",
      "https://www.instagram.com/fordhammassagetherapy/",
      "https://www.facebook.com/search/top?q=fordham%20massage%20therapy",
      "https://www.linkedin.com/in/matthew-fordham-5921a5235/"
    ]
  },
  {
    "id": "calgary-seton-brodie-lefaivre",
    "location": "CALGARY SETON",
    "trainerName": "Brodie Lefaivre",
    "trainerNumber": 18,
    "name": "Brodie Lefaivre",
    "role": "Athletic Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2025/04/Brodie.jpg",
    "bio": "Brodie Lefaivre is the Owner and Certified Athletic Therapist of BASE Athletic Therapy.\nWhether you’re chasing adventure in the mountains or chasing your kids around the house, you are an athlete of life, and you deserve to feel your best. You do not have to consider yourself an Athlete to feel the benefits of Athletic Therapy.\nAt BASE, all sessions are 1-on-1 and fully personalized. Brodie is here to help you get to the root cause of your pain—not just manage symptoms—so you can get back to doing what you love without being held back. She also works to prevent future injuries before they start.\nLet’s get you moving better, feeling stronger, and living with less pain. Let’s build your BASE!.",
    "areas_of_focus": "Chronic Pain, Headaches, Migraines & Concussions, Low back and SI dysfunction",
    "certification": ", Craniosacral Therapy, Rapid Specialist, Neurokinetic Therapy, ISSA Nutrition Coach, Shift Concussion Management Level 1 and Level 2",
    "email": "brodie@baseathletictherapy.com",
    "phone": "587-716-5587",
    "social_links": [
      "https://www.instagram.com/baseathletictherapy/%20",
      "https://baseathletictherapy.janeapp.com/"
    ]
  },
  {
    "id": "calgary-seton-errilynn-young",
    "location": "CALGARY SETON",
    "trainerName": "Errilynn Young",
    "trainerNumber": 19,
    "name": "Errilynn Young",
    "role": "Esthetician",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/08/Errilynn-Young.jpg",
    "bio": "Hello! I started this whole journey about 7 years ago working out of my home-based spa. Long story short, my husband and I decided to simplify our lives. So we sold our house (along with about 70% of the other clutter) and moved into a condo. Now, along with this fresh, simple start, I’m embarking on a brand new journey by opening my very first space outside of my home. I’m looking forward to sharing my beautiful new space with all of my wonderful existing and new clients!",
    "areas_of_focus": "Laser Hair Removal, Advanced Skin care, Anti-Aging, Skin Rejuvenation, Body Contouring & Cellulite Reduction, Waterless Manicures & Pedicures, Microdermabrasion & Dermaplaning, Waxing & Tinting",
    "certification": ", CIDESCO Beauty Therapist, Esthetician, Laser Hair Removal Technician, Advanced Photo Rejuvenation and Vascular Technician, Dermaneedling and Dermaplaning Specialist, Advanced Skincare Therapist, Advanced Pedicurist",
    "email": "errilynn@laser-haven.com",
    "phone": "403-619-9930",
    "social_links": [
      "http://www.laser-haven.com",
      "https://www.facebook.com/LHBeautyandSkincare"
    ]
  },
  {
    "id": "calgary-seton-virginia-lew",
    "location": "CALGARY SETON",
    "trainerName": "Virginia Lew",
    "trainerNumber": 20,
    "name": "Virginia Lew",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Virginia-Lew.jpg",
    "bio": "Virginia is passionate about helping people of all ages find ways to stay active despite injury and pain. She believes in empowering her patients with education to discover what their bodies are capable of, both in recovery and performance. Virginia provides physiotherapy services to rehabilitate patients with a variety of conditions, from acute musculoskeletal injuries to persistent/ chronic pain, incorporating education, strength and conditioning, manual therapy, and sport-specific approaches to guide patients back to doing what they love. Outside of the clinic, Virginia also serves acutely ill patients at the other end of the health spectrum as a physiotherapist at a local hospital.\nPrior to physiotherapy, Virginia was an English teacher in South Korea for many years. She enjoys being with family and friends, traveling, eating, and learning languages (she speaks English, Cantonese and Korean). Virginia was previously a competitive badminton player, and now enjoys Olympic weightlifting, CrossFit, running, and being really bad at snowboarding and gymnastics.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Master of Physical Therapy, Bachelor of Biology and Life Sciences",
    "email": "virginia@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/grilled.pho/"
    ]
  },
  {
    "id": "calgary-seton-laurel-irwin",
    "location": "CALGARY SETON",
    "trainerName": "Laurel Irwin",
    "trainerNumber": 21,
    "name": "Laurel Irwin",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/08/Laurel-Irwin-1.jpg",
    "bio": "I’m a mother of four children, including one delivered via emergency c-section. My smooth recoveries and bombproof pelvic floor integrity are due to heavy, technique-focused weight lifting.\nThrough determined learning, consistent training and effective nutrition, I have overcome decades-long body image fixations and insecurities as well as binge eating disorder and food addiction. I moved on to compete and win in fitness modeling shows, then reverse into normal life with health and sanity not only intact, but improved.\nThere is a parable for absolutely everything in life to be found in the weight room.\nIn everyone I coach and collaborate with, I aim to inspire self-actualization through the metaphor of fitness.",
    "areas_of_focus": "Hypertrophy, Global strength, Mental empowerment, Body composition",
    "certification": ", CanFitPro PTS",
    "email": "laurelirwin@icloud.com",
    "phone": null,
    "social_links": ["https://www.instagram.com/laurelirwinfitnesstraining/"]
  },
  {
    "id": "calgary-seton-eldridge-abat",
    "location": "CALGARY SETON",
    "trainerName": "Eldridge Abat",
    "trainerNumber": 22,
    "name": "Eldridge Abat",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/08/Eldridge-Abat.jpg",
    "bio": "I’ve been a fully certified coach since 2003. I earned my Kinesiology degree from the University of Calgary, and I’m currently completing my Master’s in Science focused on Kinesiology and Exercise Science from Concordia University. I’ve spent 19 years in the fitness industry training general population clients and competing and specialized training in Powerlifting, Natural bodybuilding, and collegiate athletes for sports such as football, basketball, and track.",
    "areas_of_focus": "Post-Rehabilitation, Strength & Conditioning, Weight-Loss, Physique Contest Prep, Powerlifting Contest Prep",
    "certification": ", Masters of Science in Kinesiology, Bachelor of Kinesiology, NSCA-Certified Strength and Conditioning Specialist (CSCS), ACSM – Exercise Physiologist (EP), Alberta Kinesiologist Association – Registered Kinesiologist (RKin)",
    "email": "movestrongyyc@gmail.com",
    "phone": "403-852-4014",
    "social_links": ["https://www.instagram.com/movestrongyyc/"]
  },
  {
    "id": "calgary-seton-maxime-malo",
    "location": "CALGARY SETON",
    "trainerName": "Maxime Malo",
    "trainerNumber": 23,
    "name": "Maxime Malo",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2025/06/Maxime-Malo.jpg",
    "bio": null,
    "areas_of_focus": "Fat loss with a focus on visceral fat loss, Body Composition adaptation, Diet and Nutrition for life longevity, Muscle growth and development, Bodybuilding from beginning to stage ready, Powerlifting from beginner to competitive stages",
    "certification": "Max’s recovery approach is rooted in personal struggle and evidence‑based techniques. A multi‑sport athlete whose career was halted by severe work‑related injuries—a concrete wall impact that subluxated his SI joint, a herniated L4–L5 disc, and chronic shoulder and hip pain—Max set out to understand healing on a deeper level. He completed over 3,000 hours of advanced clinical massage therapy certification and refined his skills in naturopathic clinics, chiropractic practices, and athletic rehabilitation facilities., Today, Max works with professional football, hockey, and speed skater athletes—helping them recover quickly and perform at their peak. His treatments are designed to optimize recovery by boosting cellular energy, reducing inflammation, and easing muscle soreness—so you can return to training stronger and more consistently., , ISSA Certified Personal trainer, 3,000+ hours advanced clinical massage therapy certification, IASTM certification, Cyriax frictions certification, FSM Sports certification, Expertise in pro sport settings",
    "email": null,
    "phone": null,
    "social_links": [
      "https://www.fresha.com/book-now/pain-labs-wn46ai21/all-offer?share&pId=2564439",
      "https://www.instagram.com/painlabs.co/"
    ]
  },
  {
    "id": "calgary-seton-lindsey-walker",
    "location": "CALGARY SETON",
    "trainerName": "Lindsey Walker",
    "trainerNumber": 24,
    "name": "Lindsey Walker",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/01/Lindsey-Walker-1.jpg",
    "bio": "Lindsey is a former soccer, sailing, basketball, and weightlifting competitor. She understands the mindset of the performance-driven athlete. She’s also a working mom who gets that life is hectic, and it rarely slows down because of pain or injury.\nShe delivers personalized, movement-focused care to clientele of all ages and athletic abilities, including high school, collegiate, and professional athletes, first responders, and the general public. She holds a Bachelor of Human Kinetics with Specialization in Strength and Conditioning from Trinity Western University and a Master of Science from the University of Alberta.",
    "areas_of_focus": null,
    "certification": ", Advanced training in Functional Dry Needling, Pelvic Health Certified, Certified Strength & Conditioning Specialist, Pursuing a Diploma of Advanced Manual and Manipulative Therapy of the Orthopedic Division, Functional Movement Screen Certified, Selective Functional Movement Assessment Certified, Advanced training with female athletes, GLA:D – Canada Certified",
    "email": "lindsey@fulcrumphysiotherapy.com",
    "phone": "403 808 6319",
    "social_links": [
      "https://www.instagram.com/fulcrum.physio/",
      "http://fulcrumphysiotherapy.com",
      "http://fulcrumphysio.janeapp.com"
    ]
  },
  {
    "id": "calgary-seton-aida-ponce-carrazc",
    "location": "CALGARY SETON",
    "trainerName": "Aida Ponce Carrazc",
    "trainerNumber": 25,
    "name": "Aida Ponce Carrazc",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/04/Aida-Ponce-Carrazc.jpg",
    "bio": "Aisha graduated from a 3000 hour program at Makami College and is a member in good standing with MTAA. She is trained in therapeutic, deep tissue, relaxation, pre and postnatal, cupping, hot stones and sports massage. Aisha’s caring for sports and her passion for alternative therapies is what led her to begin her career in massage therapy. She especially likes working with Myofascial release & stretching techniques to improve range of motion & reduce pain. In her free time, you can fifind her on her yoga mat, hiking in the mountains, or with her head in a good book! Whether seeking relief from physical dysfunction and pain, stress reduction or simply wanting to experience a greater sense of ease in your body, Aisha focuses on giving every client a therapeutic yet deeply relaxing massage.",
    "areas_of_focus": "Therapeutic, Deep Tissue, Cuping, Pre and Postnatal, Sports Massage, Hot Stone",
    "certification": ", 3000 Hour program at Makami College, MTAA",
    "email": "kaanmassage@gmail.com",
    "phone": "587-434-9251",
    "social_links": ["https://www.instagram.com/aisha_rmt7/"]
  },
  {
    "id": "calgary-seton-melnard-de-leon",
    "location": "CALGARY SETON",
    "trainerName": "Melnard De Leon",
    "trainerNumber": 26,
    "name": "Melnard De Leon",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Melnard-De-Leon.jpg",
    "bio": "During his time at University, Melnard became heavily involved in the sport of powerlifting. He first started off as a competitor, then became part of the University of Alberta Powerlifting Association executive team where he eventually served as president and hosted several meets. Melnard then transitioned his focus into coaching, where he has worked with new lifters all the way to nationally competitive powerlifters. Throughout physiotherapy school, he has helped his clients overcome various training related pains and injuries as his knowledge about rehabilitation improved.\nHaving now completed his physiotherapy schooling, Melnard is focused on using his combined experience as a lifter, coach, and clinician to help individuals overcome pain or injury so that they can return to the activities that they enjoy doing.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Bachelor of Science in Honours Physiology, Master of Science in Physical Therapy",
    "email": "melnard@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/melnard_physio/"
    ]
  },
  {
    "id": "calgary-seton-roald-palaya",
    "location": "CALGARY SETON",
    "trainerName": "Roald Palaya",
    "trainerNumber": 27,
    "name": "Roald Palaya",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/Roald-Palaya.jpg",
    "bio": "I have been Powerlifting for almost seven years, and I know how challenging it can be to achieve your goals with the overwhelming amount of information available. It is easy to get lost in the vast amount of information available and feel confused in your journey to achieve your goal. My focus is to help clients build strength and gain the knowledge they need to achieve their goals.",
    "areas_of_focus": "Strength Training, Powerlifting, Squat Technique",
    "certification": ", ISSA Certified Personal Trainer",
    "email": "roaldp@phoenixstrength.ca",
    "phone": "647-997-5104",
    "social_links": ["https://www.instagram.com/phoenix_strength_yyc/"]
  },
  {
    "id": "calgary-seton-terrace-boath",
    "location": "CALGARY SETON",
    "trainerName": "Terrace Boath",
    "trainerNumber": 28,
    "name": "Terrace Boath",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Terrace-Boath.jpg",
    "bio": "Growing up Terrace played soccer, basketball, volleyball and did triathlon training. Terrace didn’t discover her true athletic passion however until she discovered weightlifting as a young adult.\nDissatisfied with her own rehabilitation experiences as an athlete, Terrace set out to become a physiotherapist. She pursued a Bachelor of Kinesiology at the University of Calgary, and later her Master’s in Physical Therapy from the University of Alberta.\nTerrace remains a student of the human body; always up for new activities. She brings the same attitude to the treatment of her clients. She loves to empower others to achieve their goals. Terrace believes rehabilitation is not simply about resolving pain, but also about improving performance.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Bachelor of Kinesiology, Masters of Science in Physical Therapy, Certificate of Cervico-Thoracic Manipulation",
    "email": "terrace@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/tbo.physio/"
    ]
  },
  {
    "id": "calgary-seton-cate-bangdo",
    "location": "CALGARY SETON",
    "trainerName": "Cate Bangdo",
    "trainerNumber": 29,
    "name": "Cate Bangdo",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/09/CATE-BANGDO.jpg",
    "bio": "Being raised in the fitness industry, I knew that I had it in me for helping others start their own fitness journey and finding the perfect balance. Individuals are unique and have their own goals, signifying that training and overall lifestyle will vary depending on each individual. My services are based on each client and their needs to thrive and maintain a balanced and healthy lifestyle.",
    "areas_of_focus": "Strength and Conditioning, Hypertrophy, Women’s Fitness, Nutrition Coaching",
    "certification": ", PN1, CANFITPRO PTS, NASM CPT, TRX YFC",
    "email": "Paradoxfitnessyyc@gmail.com",
    "phone": "403-926-6896",
    "social_links": ["https://www.instagram.com/catebtraining/"]
  },
  {
    "id": "calgary-seton-dan-messenger",
    "location": "CALGARY SETON",
    "trainerName": "Dan Messenger",
    "trainerNumber": 30,
    "name": "Dan Messenger",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2025/04/Dan-Messenger.jpg",
    "bio": null,
    "areas_of_focus": "Fat loss with a focus on visceral fat loss, Body Composition adaptation, Diet and Nutrition for life longevity, Muscle growth and development, Bodybuilding from beginning to stage ready, Powerlifting from beginner to competitive stages",
    "certification": "As a local Calgary Firefighter and Fitness coach, I have been serving my community for over 15 years helping many to reach their goals in health and wellness. If you are looking for a holistic approach to a well-balanced fitness program, look no further. As a straight shooter, I don’t sugar coat, I’ll tell you what you need to hear and help you to get the results you desire. My recent focus of study and training has been on female hormonal changes through life and how to incorporate training and nutrition into their lifestyle. This, accompanied with a recent certification in the aforementioned and in the Barbell Rehab Method, my focus continues to be committed to learning to offer the best available training programs to enhance exercise for all individuals who may have experienced injury or instability in weight training as well as working with the knowledge of female hormonal cycles during pregnancy stages as well as through all menopausal stages., , ISSA Certified Personal trainer, ISSA Bodybuilding Specialist, ISSA Nutritionist, ISSA Glute Specialist, Barbell Rehab Method Certification, Barbell Rehab Method – Unique Considerations for the Female Barbell Athlete including, Pre/Intra/Post Pregnancy as well as Peri/Post Menopausal stages",
    "email": "FirstDuePT@gmail.com",
    "phone": null,
    "social_links": [
      "http://www.first-due-pt.com",
      "https://www.instagram.com/firstduept/"
    ]
  },
  {
    "id": "calgary-seton-jessica-chan",
    "location": "CALGARY SETON",
    "trainerName": "Jessica Chan",
    "trainerNumber": 31,
    "name": "Jessica Chan",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/10/Jessica-Chan.jpg",
    "bio": "As a wellness specialist and a mother to a wonderful 7-year-old, my fitness journey began post-pregnancy when I grappled with weight and mental health challenges. Initially, I tackled nutrition, reclaiming control, and then discovered the gym, experiencing significant changes. Fitness completely changed my life, in so many ways, physically, mentally and emotionally. Having thrived in the health and wellness field for over 5 years, I advocate for the transformative power of fitness in overall health and well-being. My mission is to help individuals transform their bodies and enhance their health, without overwhelm, emphasizing personalized nutrition and exercise. I believe in the uniqueness of a training program. I focus on really getting to know you and your specific needs and goals, and guiding you through an enjoyable and sustainable fitness journey.\nThanks so much for meeting with me today and I am very excited to get started. And thank you for all your help and support.",
    "areas_of_focus": "Body Composition, Weight loss, Mobility, Strength Development, Hypertrophy, Lifestyle Change, Nutritional Strategy",
    "certification": ", Canfitpro Personal training specialist, Ideal Protein – weight loss coach",
    "email": "Jessica.bodybalancehealth@gmail.com",
    "phone": "403-918-9692",
    "social_links": [
      "https://www.instagram.com/jessica.bodybalance/",
      "https://www.body-balance-health.com/"
    ]
  },
  {
    "id": "calgary-seton-ryan-hanson",
    "location": "CALGARY SETON",
    "trainerName": "Ryan Hanson",
    "trainerNumber": 32,
    "name": "Ryan Hanson",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/Ryans.jpg",
    "bio": "The most in depth personal training dedicated to teaching clients progressions, regressions and activation warm-ups to help you see massive success in reaching your goals.\nWith Hardwired Wellness personal training you will utilize multiple training modalities, and the skill acquisition model to keep progressing while balancing your strength with mobility & stability.\nWe are always assessing to improve performance, skill development, and injury prevention creating training sessions with incredible results.\nWe guarantee your results. If you don’t reach your goals in the agreed upon timeframe we will train you for free until you do.",
    "areas_of_focus": "Exercise Programming & Execution, Movement Development & Restoration, Human Performance, Exercise Programming, Breathwork, Lifestyle Realignment",
    "certification": ", Pre-Script L1, MP-Prime, MP-Prime Pro, Move U, NCI Gut Health.",
    "email": null,
    "phone": "403-918-2387",
    "social_links": [
      "https://www.instagram.com/hardwiredwellness/",
      "http://www.hardwiredwellness.com"
    ]
  },
  {
    "id": "calgary-seton-leisha-bettcher",
    "location": "CALGARY SETON",
    "trainerName": "Leisha Bettcher",
    "trainerNumber": 33,
    "name": "Leisha Bettcher",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Leisha-Bettcher-.jpg",
    "bio": "Leisha grew up playing multiple sports including volleyball and basketball.  It was through the discovery of dance, however, that she truly found her passion for movement.  She went on to complete a Bachelor of Arts Degree majoring in contemporary dance through the University of Winnipeg. Continuing education opportunities brought Leisha to Calgary where she then became a registered massage therapist with the goal of providing active therapeutic treatments and athlete-centered care. In addition to massage therapy, Leisha works with the Calgary Buffalo Hockey Association as a team trainer for acute injury management throughout their hockey season.\nWhen she’s not helping you with your movement goals, you’ll find Leisha hanging out with her husband and two busy kids, possibly out for a walk with her quirky three-legged springer spaniel, or exploring a new sport (like olympic weightlifting) to help her better understand the biomechanics of what YOU do!",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Bachelor of Arts in Contemporary Dance,, Registered Massage Therapist",
    "email": "leisha@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/leisha.b.rmt/"
    ]
  },
  {
    "id": "calgary-seton-joshua-tavora",
    "location": "CALGARY SETON",
    "trainerName": "Joshua Tavora",
    "trainerNumber": 34,
    "name": "Joshua Tavora",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2021/12/Joshua-Tavora.jpg",
    "bio": "What I enjoy the most about being a trainer is seeing the client’s personal journey of developing a positive mindset, overcoming obstacles, and achieving milestones of success they never thought possible. I have worked with a variety of clientele with different goals and have always managed to show them how to have a healthy and well balanced lifestyle which is built on the foundations of strength training.",
    "areas_of_focus": "POWERLIFTING: Focusing on SBD lifts (squat, bench, deadlift) by teaching proper form and technique, POWER-BUILDING: Focusing on the mix of strength training and volume-based training, PAIN-FREE MOBILITY TRAINING: Focusing on body mechanics and improving mobility for overall wellbeing and pain-free performance",
    "certification": ", NASM-CPT (Certified Personal Trainer), AFLCA Group Specialty Leader, PPSC Pain-Free Performance Specialist",
    "email": "josh_tavora@yahoo.com",
    "phone": "403-672-0145",
    "social_links": ["https://www.instagram.com/josht.training/"]
  },
  {
    "id": "calgary-seton-loring-derry",
    "location": "CALGARY SETON",
    "trainerName": "Loring Derry",
    "trainerNumber": 35,
    "name": "Loring Derry",
    "role": "Physiotherapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2024/02/Loring-Derry.jpg",
    "bio": "Loring’s experience as a former athlete has fuelled her passion for helping others improve their health through movement. As a former national-level rhythmic gymnast, she knows first-hand the benefits of exercise as therapy for overcoming pain and improving performance. She believes in helping others find their potential in their own bodies, no matter the stage of injury or ailment. She treats patients of all ages and abilities but has a special interest in treating the lower extremity and spinal pain.\nLoring completed her Masters of Science in Physical Therapy at the University of Alberta in 2014, following her BA (Honours) at the University of Victoria in 2010.\nOutside of the clinic she enjoys running (long distance, and after her two young kids) and weight training.",
    "areas_of_focus": "Chan Gunn Intramuscular stimulation, Functional Dry Needling, Advanced Practice Physiotherapy: Medical Screening, Laboratory testing, Medical Diagnostic Imaging, Pharmacology, Level III Canadian Physiotherapy Association Orthopedic division manual therapy, Training in fibromyalgia and central sensitization, Running injury prevention and training",
    "certification": null,
    "email": "loring@fulcrumphysiotherapy.com",
    "phone": null,
    "social_links": ["https://www.fulcrumphysiotherapy.com/"]
  },
  {
    "id": "calgary-seton-julia-comeau",
    "location": "CALGARY SETON",
    "trainerName": "Julia Comeau",
    "trainerNumber": 36,
    "name": "Julia Comeau",
    "role": "Esthetician",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/02/Julia-Comea.jpg",
    "bio": "Julia’s passion for health and beauty combined with her desire to help people is what inspired her to open Reflection Beauty Bar. She is a certified lash technician, brow lamination specialist and skin/facial therapist. She is committed to helping her clients feel comfortable and confident both in their skin and in her studio. Outside of work, Julia has devoted her self to staying active at the gym and spending time with her friends, family and dogs; Skylar and Brixten.",
    "areas_of_focus": "Certified Lash Tech, Brow Lamination Specialist, Skin / Facial Therapist",
    "certification": null,
    "email": "reflectionbeautyb@gmail.com",
    "phone": null,
    "social_links": ["https://www.instagram.com/reflection_beautybar/"]
  },
  {
    "id": "calgary-seton-brent-corcilles",
    "location": "CALGARY SETON",
    "trainerName": "Brent Corcilles",
    "trainerNumber": 37,
    "name": "Brent Corcilles",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/02/Brent-Corcilles.jpg",
    "bio": "With 7 years of general training experience and another 3 years of powerlifting experience, Brent has successfully coached powerlifters of all skill levels to help them reach their full potential.\nI have been to multiple Powerlifting competitions, both as a competitor and a handler and I strive to be a person of influence and support to all my clients – Something I wish I had when I first started on my journey with this sport.\nMost of my clients are online so I am excited to finally have the space and equipment to help you reach your goals. Whether your goal is to look and feel good, gain strength, learn proper form, or set new PRs – I am ecstatic to meet you!",
    "areas_of_focus": "Strength Coaching, Squat, Bench, & Deadlift Form and Technique, Powerlifitng Training, Powerlifting Competition Preparation",
    "certification": ", ELA Personal Training Diploma, American Certificate on Exercise – Personal Training Certificate",
    "email": "brcorcilles@gmail.com",
    "phone": null,
    "social_links": [
      "https://teamcor.ca/",
      "https://www.instagram.com/liftbrent/"
    ]
  },
  {
    "id": "calgary-seton-calvin-larson",
    "location": "CALGARY SETON",
    "trainerName": "Calvin Larson",
    "trainerNumber": 38,
    "name": "Calvin Larson",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/Calvin.jpg",
    "bio": "I am extremely passionate about helping people achieve their fitness and lifestyle goals. I Starting my fitness journey in my 40s and so I can relate to how difficult this commitment can be. I have 10 years of voluntary coaching youth football experience and believe there is no substitute for hard work. I am a competitive powerlifter and with this experience I aim to help my clients push through physical and mental roadblocks.",
    "areas_of_focus": "Strength and Conditioning, Lifestyle change, Weight Loss, Powerlifting, Corrective Exercise, Joint mobility, Athletic performance",
    "certification": ", ISSA Certified Personal Trainer, CPR First Aid",
    "email": "chlarsonjr@hotmail.com",
    "phone": "403-399-8666",
    "social_links": ["https://www.instagram.com/larson_lifestyle_coaching/"]
  },
  {
    "id": "calgary-seton-kris-linares",
    "location": "CALGARY SETON",
    "trainerName": "Kris Linares",
    "trainerNumber": 39,
    "name": "Kris Linares",
    "role": "Personal Trainer",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2022/11/Kris-Linare.jpg",
    "bio": "I’ve been in the gym space for about 5 years with a background in competitive powerlifting for 2 years. It’s been a lengthy process returning to training as I have accumulated many injuries throughout my tenure in sport and the gym, a real “glass cannon” in the scene. I strive to help others achieve their goals while also avoiding the mistakes I have made along the way. We will work together to build a strong foundation for your future and get you where you need to go, all you have to do is agree to suffer a little while with me.",
    "areas_of_focus": "Injury Recovery, Powerlifting, Weight Loss",
    "certification": ", ISSA – Certified Personal Trainer",
    "email": "Coachkl.fit@gmail.com",
    "phone": null,
    "social_links": []
  },
  {
    "id": "calgary-seton-maria-gilchrist",
    "location": "CALGARY SETON",
    "trainerName": "Maria Gilchrist",
    "trainerNumber": 40,
    "name": "Maria Gilchrist",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/06/Maria-Gilchrist.jpg",
    "bio": "Maria grew up in Medicine Hat, Alberta, where she spent more time reading books than moving her body.  By high school, her mother recognized the need for more movement and enrolled Maria in a yoga class.  She fell in love and has practiced and studied yoga ever since, completing trainings in vinyasa and yin.  While yoga was the doorway to movement for Maria, she discovered strength training a few years later and is passionate about the ways that the two practices compliment one another.\nThis passion fuelled an interest in the human body and a desire to help people move sustainably in whatever ways they love or need to. Maria connected these dots and eventually decided to pursue a career in Massage Therapy, completing her diploma at Mount Royal University.  She believes in effective, proactive treatment and the combination of movement and manual therapy as medicine.",
    "areas_of_focus": "At DynamicYYC, we are active therapists that fit your active lifestyle to keep you doing what you love.",
    "certification": ", Registered Massage Therapist",
    "email": "maria@dynamicyyc.com",
    "phone": "587-880-2925",
    "social_links": [
      "http://www.dynamicyyc.com",
      "https://www.instagram.com/littleone666/"
    ]
  },
  {
    "id": "calgary-seton-koby-hannem",
    "location": "CALGARY SETON",
    "trainerName": "Koby Hannem",
    "trainerNumber": 41,
    "name": "Koby Hannem",
    "role": "Massage Therapist",
    "image": "https://www.evolvestrength.ca/wp-content/uploads/2023/05/Kobys.jpg",
    "bio": "The Table Massage and Manual Therapy is a clinic for pain, performance and wellness. Offering traditional massage therapy for wellness and active therapy sessions targeted toward relieving pain, restoring function, and optimizing performance.\nKoby is a former athlete, a parent and business owner. He knows what it takes to keep the performance athlete at the top of their game just as well as he knows how to keep the busy adult in optimal health to navigate their every day grind. Whatever your lifestyle and priorities, Koby can keep you at your best.",
    "areas_of_focus": null,
    "certification": ", Rapid NFR Specialist, Master Myoskeletal Therapist, Concussion Protocol Level 1, Advanced Fascial Release Cupping",
    "email": "koby@thetablemmt.com",
    "phone": "587-707-2738",
    "social_links": ["https://www.instagram.com/thetable.mmt/"]
  }
]
