[
  {
    "id": "calgary-royal-oak-bryan-shymko",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Bryan Shymko",
    "trainerNumber": 1,
    "name": "Bryan Shymko",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/ccc.jpg",
    "bio": "Bryan Shymko is a certified personal trainer with over 12 years of experience in the fitness industry. He has a passion for helping people, and is dedicated to improving his clients’ quality of life through exercise and movement.\nBryan uses scientific principles and the Functional Range System (FRS) to help guide his process to health and fitness. With a high-quality assessment, we can determine physical deficiencies and capacities to better develop strategies to achieve specific, high-quality results. Through the lens of evolutionary human biology, he takes a simple approach to programming and preaches the basics.\nHis client-centered, results-focused approach is a big reason Bryan has been successful in the training industry. He is always trying to better himself and learn more through continuing education, mentorships and everyday practice. Bryan is currently accepting clients of all levels and experience.",
    "areas_of_focus": "General Population, Mobility Training and Movement, Joint Optimization and Performance, Older Adult and Senior Programs",
    "certification": "Human Kinetics Diploma- COTR, Kinesiology Degree –University of Lethbridge, Internal Strength Model(ISM)- Strength Coach, FRC mobility specialist/ FRA/ KINSTRETCH®, FRC Summit 2.0: Advanced Linear Loading",
    "email": null,
    "phone": null,
    "social_links": [
      "http://shymkopersonaltraining.com",
      "https://www.instagram.com/shymkopt/"
    ]
  },
  {
    "id": "calgary-royal-oak-allison-kiss",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Allison Kiss",
    "trainerNumber": 2,
    "name": "Allison Kiss",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Allison-Kiss.jpg",
    "bio": "Allison is passionate about wellness and helping people feel fantastic. Taking a whole person, or holistic\napproach, Allison strives to empower positive lifestyle changes for long term success. As a Nutritionist,\nPersonal Trainer and Life Coach, Allison brings a wealth of experience in assisting people in living their\nmost authentic, fulfilling, and beautiful lives! When not in the gym, you can find Allison enjoying time in\nthe mountains with her two teenagers and schnoodle, Gryffindor.",
    "areas_of_focus": "Pre & Post Natal Wellness, Weight Loss, General Population Wellness, Injury Rehabilitation, Sustainable Wellness, Individual, Couples & Small Group Fitness",
    "certification": "Bachelor of Kinesiology, U of C, Bachelor of Education, U of C, Holistic Nutritionist, Canadian School of Natural Nutrition, Life & Wellness Coach, Canada Coach Academy; ICF Candidate",
    "email": "allikiss2015@gmail.com",
    "phone": null,
    "social_links": ["https://www.kisscoaching.ca/"]
  },
  {
    "id": "calgary-royal-oak-jimmy-hartley",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Jimmy Hartley",
    "trainerNumber": 3,
    "name": "Jimmy Hartley",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Jimmy-Hartley.jpg",
    "bio": "My name is Jimmy Hartley and I help successful men over 40 get back into amazing shape, setting the clock back 10 years so they can protect and provide better for those that depend on them, by building visible muscle, shedding belly fat, and boosting testosterone naturally, all without spending 2 hours a day at the gym and eating a bunch of damn salad.\nI’ve been a coach in the fitness industry for over 20 years, having trained thousands of clients, I’ve been a multiple location gym owner, have a Kinesiology degree from the University of Calgary, am a Medical Exercise Specialist, and best trainer in the world (according to my Mom).",
    "areas_of_focus": "Pre & Post Natal Wellness, Weight Loss, General Population Wellness, Injury Rehabilitation, Sustainable Wellness, Individual, Couples & Small Group Fitness",
    "certification": "Bachelor of Kinesiology, U of C, Bachelor of Education, U of C, Holistic Nutritionist, Canadian School of Natural Nutrition, Life & Wellness Coach, Canada Coach Academy; ICF Candidate",
    "email": null,
    "phone": null,
    "social_links": ["https://www.instagram.com/dadbodtoradboddecoded/"]
  },
  {
    "id": "calgary-royal-oak-jashua-white",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Jashua White",
    "trainerNumber": 4,
    "name": "Jashua White",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Jashua-White.jpg",
    "bio": "Hi there! I’m Josh White, a fitness professional with over 15 years of experience in researching and implementing evidence-based training and nutrition practices. I’ve been lucky enough to not only achieve individual success in various sports but also to help hundreds of people reach their own fitness goals, despite any obstacles they may face.\nThroughout my career, I’ve worked with a diverse group of individuals, from world-champion BJJ players and national athletes to busy professionals and stay-at-home mothers. But no matter who I work with, they all have three things in common:\n– They have the drive to become the best version of themselves.\n– They want to know that they are receiving the highest quality of coaching for their investment.\n– They prioritize their health, fitness, and performance in their busy lives.",
    "areas_of_focus": "General Population Strength and Conditioning, Performance Coaching, Olympic Style Weightlifting, Outpatient Rehabilitation + Lifestyle Intervention",
    "certification": "31 marathon, competing at the international level in CrossFit, and holding a provincial weightlifting record., When you train with me or any of the coaches at Alchemy Training, you’ll have access to a team of experts who always strive to do their best. With hard work and dedication, you can be confident that you’ll reach even your most ambitious fitness goals., , Bachelor’s of Health and Physical Education (3.97GPA), CSEP – Clinical Exercise Physiologist, NSCA – Certified Strength and Conditioning Specialist, NSCA – Certified Personal Trainer, CrossFit Level 2 Trainer, CrossFit Weightlifting L-1, NCCP Weightlifting (Trained)",
    "email": null,
    "phone": null,
    "social_links": [
      "http://www.alchemytraining.ca",
      "https://www.instagram.com/joshuawhite.pt/"
    ]
  },
  {
    "id": "calgary-royal-oak-taylor-beaudry",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Taylor Beaudry",
    "trainerNumber": 5,
    "name": "Taylor Beaudry",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Taylor.jpg",
    "bio": "I’m Taylor. I’m an energetic and positive human who loves to help people live abundant and healthy lives. I’m also an Orthopaedic Massage Therapist, which means I treat injuries, chronic pain, and correct postural dysfunction. What I really do is give people the freedom to connect better with themselves, their bodies, their families, and communities. For the last 5 years, I’ve trained and practiced under the best Orthopaedic Massage Therapists in the country, and I’m passionate about sharing this learning with my community!\nI believe that Every Body deserves to experience pain-free living in order to focus better, sleep well, and enjoy the activities that they love!\nThe real reason I do what I do is because Orthopaedic Massage changed my life, and I know it can change so many more!",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": ["http://auroramassageandwellness.com"]
  },
  {
    "id": "calgary-royal-oak-corliss-robertson",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Corliss Robertson",
    "trainerNumber": 6,
    "name": "Corliss Robertson",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Corliss-Robertson.jpg",
    "bio": "Corliss is a Registered Massage Therapist and Advanced Frequency Specific Microcurrent (FSM) practitioner, as well as an instructor of the Massage Therapy Diploma program. She graduated with honours from Vicars School of Massage Therapy and is a member of the Massage Therapy Association of Alberta.\nCorliss offers in-depth orthopedic assessments, therapeutic, deep tissue, relaxation, and cupping massage. Corliss has also continued her education with training in Kinesio Taping, Graston, and Myofascial Release.\nCorliss’ passion lies with FSM, which is a cutting-edge treatment that provides patients with painless, accelerated healing, often in conditions that haven’t responded to other treatments. FSM uses specific frequencies and micro amperage current to target specific tissues and conditions. Corliss integrates massage techniques with FSM to treat nerve pain, muscle pain, and many other medical conditions.\nCorliss has based her professional career on helping others and has extensive hands-on experience with injury and disease processes. Prior to becoming a Massage Therapist, Corliss was an Emergency Medical Technician and Volunteer Firefighter. During this time, she learned valuable critical thinking and patient assessment skills.\nCorliss made the decision to become a Massage Therapist and FSM practitioner after sustaining multiple injuries. She had lived in chronic pain, had limited mobility, and decreased strength. All of this improved for Corliss after receiving regular Massage Therapy and FSM treatments. Corliss is particularly interested in the role that massage can play in rehabilitation after injury and is dedicated to helping her clients get back to pain-free, healthy, active lifestyles.",
    "areas_of_focus": null,
    "certification": null,
    "email": "fsmcalgary@gmail.com",
    "phone": "403-470-9994",
    "social_links": ["http://balancedhealththerapy.ca"]
  },
  {
    "id": "calgary-royal-oak-joel-porayko",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Joel Porayko",
    "trainerNumber": 7,
    "name": "Joel Porayko",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Joel.jpg",
    "bio": "Joel has been working as a coach and personal trainer since 2010. A lifelong athlete and fitness enthusiast, Joel has been competitive in hockey, baseball, and weightlifting, and is currently training in powerlifting. Joel began training in southwest Calgary, working with individuals pursuing everything from high level athletics to general health and wellness. Since 2016 he has worked as a strength and conditioning coach for hockey, lacrosse, soccer & basketball athletes ranging from the ages of 14 to 35. Joel is a recent graduate of Mount Royal University, where he obtained a bachelor’s degree in Health and Physical Education majoring in Physical Literacy. The focus of his studies was how to help individuals feel competent and confident in their capabilities pertaining to physical activity. His goal is to help those he works with develop a love of exercise that will carry forward throughout their entire lives.",
    "areas_of_focus": null,
    "certification": "B.HPED (Physical Literacy), CSEP CPT, NCCP Weightlifting, Precision Nutrition L1 Coach",
    "email": null,
    "phone": "403-660-6902",
    "social_links": ["https://www.instagram.com/coachjp.yyc/"]
  },
  {
    "id": "calgary-royal-oak-vicky-lasenzaniro",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Vicky Lasenzaniro",
    "trainerNumber": 8,
    "name": "Vicky Lasenzaniro",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/vickys.jpg",
    "bio": "Vicky became a trainer after struggling with declining health and joint function from working in an office environment. She hired a trainer and pursued the education that would allow her to free people from the same issues. After having resolved her own shoulder, back, hip, and knee issues, she has a unique perspective on what it takes to regain function.\nDuring this time she discovered powerlifting and fell in love with building strength and testing her limits. Vicky has competed at a National level and coaches a team of athletes in the CPU. Being a competitive powerlifter has taught Vicky how to apply exercises to free people from limitations and perform their best.",
    "areas_of_focus": "Competitive Powerlifting, Biomechanics-based strength training, Joint function and strengthening, Strength Sport, Fitness for Office Workers",
    "certification": "Personal Trainer Diploma (ELA), American Council on Exercise (ACE) Personal Training Certification, IFH Powerlifting, Olympic Lifting, and Kettlebell, ACE Orthopedic Exercise Specialist, Functional Range Conditioning (FRC)",
    "email": "vix.coaching@mibz.ca",
    "phone": "403-827-2165",
    "social_links": ["https://www.instagram.com/vix.strength.performance/"]
  },
  {
    "id": "calgary-royal-oak-steph-kennedy",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Steph Kennedy",
    "trainerNumber": 9,
    "name": "Steph Kennedy",
    "role": "Athletic Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Steph-Kennedy.jpg",
    "bio": "Steph has been working in the Health & Wellness industry as a Certified Athletic Therapist since 2017. She is passionate about helping individuals with chronic pain or new injuries regain their quality of life. By utilizing a combination of manual therapy and exercise rehabilitation, Steph is able to assist individuals in reducing pain, regaining strength, and improving mobility which allows them to continue pursuing whatever daily or athletic activities they are passionate about.\nSteph is also passionate about pursuing her own athletic activities which include strength training, Muay Thai, obstacle course races, and hiking. She continues to pursue new and better ways to help her patients with continuing education courses to build her knowledge and refine skills.\nSteph graduated from the University of Lethbridge with a Bachelors of Exercise Science and Mount Royal University with an Advanced Athletic Therapy Certificate. She passed the Canadian Athletic Therapists Association’s national exam to become a Certified Athletic Therapist in 2017.",
    "areas_of_focus": "Acute & Chronic Injury Assessment, Manual Therapy, Injury Prevention, Exercise Rehabilitation",
    "certification": "Bachelors of Exercise Science, BEXSc., Certified Athletic Therapist, CAT(C)",
    "email": "yyc.athletictherapy@gmail.com",
    "phone": "780-318-8997",
    "social_links": ["https://yycathletictherapy.square.site/"]
  },
  {
    "id": "calgary-royal-oak-gill-wong",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Gill Wong",
    "trainerNumber": 10,
    "name": "Gill Wong",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Gill-Wong.jpg",
    "bio": "After taking up strength training to help manage her mental health, Gill learned the value integrating movement and nutritional awareness into everyday life, and is passionate about sharing these benefits with those she works with. She emphasizes educating her clients on the importance of proper form, mobility, strength training and nutrition in order to help clients reach their goals as effectively as possible.\nWhat sets Gill apart is her Muay Thai and kickboxing experience. She is an active fighter with 8 years of experience, having fought numerous times in both Canada and Thailand. This has given her valuable ring experience that she passes on to\nher clients. She believes that martial arts has no age, size or fitness limits- it’s never too late or too early to learn something new. If you are looking to increase confidence, focus, speed/power and cardio all while having an engaging workout and burning tons of calories-she is the trainer for you. She will teach you proper striking technique, while making sure you put in the work and having the most fun you can possibly have in the gym.",
    "areas_of_focus": "Muay Thai/Kickboxing/Boxing, General fitness, Strength training, Fat Loss, Injury prevention and management",
    "certification": "ACE Certified Personal Trainer, ELA Personal Training Diploma, ACE Sports performance, ACE Sports Nutrition, IFH Olympic lifting, powerlifting and kettlebells, TRX Training",
    "email": "gwongfit@gmail.com",
    "phone": "587-435-6544",
    "social_links": [
      "https://www.instagram.com/gillwongofficial/?igshid=YmMyMTA2M2Y%3D"
    ]
  },
  {
    "id": "calgary-royal-oak-lisa-thoreson",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Lisa Thoreson",
    "trainerNumber": 11,
    "name": "Lisa Thoreson",
    "role": "Social Worker",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Lisa.jpg",
    "bio": "I am a registered Social Worker (BA, MSW, RSW) with over 20 years of experience in addiction & mental health working with individuals, families, and groups. I believe in working with my clients from a non- judgmental, strength-based perspective to determine what goals are most important to them, and in using a direct, compassionate approach to negotiate their achievement.\nMy practice areas are as follows:\n· Substance use assessment & treatment\n· Mental/ Emotional health assessment & treatment- mood, anxiety, BPD\n·Perinatal mental health/ post-partum anxiety & depression\n·\nChildren age 10 and up, adolescents, adults\n· Family conflict\n· Trauma\n· Relationship issues\n· Life transitions/ stress\n· Coping skills\n· Parenting ​/Parent-child relational concerns\n· Self-harm/ suicidality\n· ADHD\n· Grief & loss",
    "areas_of_focus": null,
    "certification": null,
    "email": "lisathoresoncounselling@telus.net",
    "phone": "403-768-5389",
    "social_links": ["https://lisathoresoncounse.wixsite.com/lisatcounselling"]
  },
  {
    "id": "calgary-royal-oak-terry-quach",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Terry Quach",
    "trainerNumber": 12,
    "name": "Terry Quach",
    "role": "Personal Trainer / Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Terry-1.jpg",
    "bio": "Terry graduated from the 2200-hour Massage Therapy program in 2017 and Personal FitnessTrainer program in 2022 at Mount Royal University. He is trained in therapeutic deep-tissue massage, neurokinetic therapy, hip orthopedic massage, and dynamic cupping. He focuses on the efficiency of movement through mobility and strength of the joints and muscles by providing educated insight on how you can improve and by providing massage techniques to specific areas of the body. He believes that assessments are a necessary part of treatment to achieve an understanding of how what condition your body is in. By combining massage therapy and personal training together, he hopes to create a more effective healing effect. In his spare time, he loves to spend time at the gym, camping, fishing and spending time with his family and friends. His motto for training and treatment is “short-term progress for long-term success”",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": ["https://www.instagram.com/empoweredhf/"]
  },
  {
    "id": "calgary-royal-oak-arnelia-cortez",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Arnelia Cortez",
    "trainerNumber": 13,
    "name": "Arnelia Cortez",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Arnelia-Cortez.jpg",
    "bio": "Arnelia has been a licensed massage therapist for over 20 years. She is passionate about using advanced orthopedic and natural manual massage therapy techniques to help clients recover, heal faster and reach their peak health performance potential. She is especially focused on acute and chronic conditions, advanced assessment and treatment of all conditions and MVA/work injury rehabilitation therapy. She treats clients from infants to the elderly, athletes, fitness enthusiasts and pregnant women.\nArnelia earned her Bachelor of Science degree in Zoology at a University in the Philippines. She started learning reflexology and massage in 1994 and became the founder of Natural Healing &Wellness in 1999 while still living in the Philippines. She then moved to Athens, Greece and gained 6 years of additional hands-on experience and training in massage therapy. When she moved to Calgary in 2009, she spent 2 more years in massage therapy school. With this added knowledge and her life experience, she now teaches others her advanced skills and knowledge of massage therapy and reflexology.\nArnelia has completed more than 3000 hours of advanced education and training of massage therapy in Calgary. Today she confidently offers the best-advanced massage therapy in Calgary.",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://cortezmassage.ca/",
      "https://www.instagram.com/corteznaturalhealing/"
    ]
  },
  {
    "id": "calgary-royal-oak-emi-hayami",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Emi Hayami",
    "trainerNumber": 14,
    "name": "Emi Hayami",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Emi-Hayami.jpg",
    "bio": "After many years of working as an engineer, I went back to school to become a personal trainer.I am convinced of the power of movement and want to positively impact people’s lives. I believe one way to do this is to help people unlock the best versions of themselves by ensuring their bodies are performing their best.\nGood performance requires quality movement, which means working from a strong and stable base. I coach proper movement patterns to improve mobility, build capacity, strength, and power. I am a problem solver, attentive, detailed oriented, and committed to getting results. I have experience training individuals with low back, knee, ankle, and shoulder pain. I also have experience rehabbing my own body after many injuries (ankle, foot, knees, hips, low back, and shoulders). I bring this experience to help my clients move better, get stronger, and feel better.\nI am currently training for my first weightlifting competition with Coach Curtis and am excited to be working with the Howden Movement Academy team!",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://www.instagram.com/_movingstrong_/",
      "https://movingstrong.ca/"
    ]
  },
  {
    "id": "calgary-royal-oak-murray-roberts",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Murray Roberts",
    "trainerNumber": 15,
    "name": "Murray Roberts",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Murray-Roberts.jpg",
    "bio": "My name is Murray Roberts and I’ve been working as a Personal Trainer since 2016. I developed a passion for health & fitness from my background in Sports and the feeling of accomplishment when I reached my original fitness goals when I was 16. I have had the privilege of working with a very diverse group of clientele over the course of my career. Throughout my career the most common demographic I have worked with is men and women aged 50+ and beginners (Primarily youth).\nWhen you attend one of my training sessions I want you to feel like you’ve learned something, accomplished something new or just feel better than when you walked in. I would describe my style of training as a combination of Strength Training, Athletic Conditioning, and a little bit of Mobility. I like to practice what I preach in terms of training. I want to remain strong and pain free, but I also want to be able to apply it athletically. When I’m not in the gym I really enjoy skiing in the winter, and playing basketball or football with friends in the summer.",
    "areas_of_focus": "General Population Strength & Conditioning, Older Population Strength & Conditioning, Youth Training, Athletic Performance, Body Composition/Transformation, 1 on 1, Partner & Small Group Training",
    "certification": "CSEP – Certified Personal Trainer, MRU Personal Fitness Trainer Diploma",
    "email": "murray.roberts.52@gmail.com",
    "phone": "403-607-3270",
    "social_links": ["https://www.instagram.com/maxoutmurr/"]
  },
  {
    "id": "calgary-royal-oak-jacobie-bosch",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Jacobie Bosch",
    "trainerNumber": 16,
    "name": "Jacobie Bosch",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/jacobie-1.jpg",
    "bio": "Jacobiehas her 2200 hour diploma from Mount Royal. She’s have been practicing massage therapy since 2012 and loving every moment! Before getting into the massage program she was also doing therapy work with Body Talk and Reiki which she now incorporates into her practice. Massage therapy is so beneficial for physical, emotional, mental well being. Clients say I have a firm therapeutic, yet gentle approach. I use my intuitive touch along with my years of experience to give you a very personalized and unique massage experience.  I have experience in deep tissue, therapeutic massage, prenatal massage, sports and postural/work related injury and rehabilitation, headaches, trigger point therapy and TMJ dysfunction. I also have my RAPID NFR training to work with facial restrictions, scar work, pelvic floor and core.\nA bit about me, I grew up on a farm in Saskatchewan, moved to Calgary in 2001.I have 2 beautiful babies that this career allows me to spend so much time with. I love the mountains, music, spending time with friends and family, making others laugh in any way I can.\nI look forward to seeing you see soon!",
    "areas_of_focus": null,
    "certification": null,
    "email": "jacobiesproule@yahoo.com",
    "phone": "403-813-5085",
    "social_links": [
      "https://jacobie.janeapp.com/#staff_member/1",
      "https://www.instagram.com/wellnessjacobie/"
    ]
  },
  {
    "id": "calgary-royal-oak-steven-wapple",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Steven Wapple",
    "trainerNumber": 17,
    "name": "Steven Wapple",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Steven-Wapple.jpg",
    "bio": "Steven loves adventure and is always happy to get people outdoors, playing, exploring, having\nfun and being active.\nIf you cannot find Steven at the gym, he is most likely on some far away river paddling or some\nmountain top with his wife Genevieve and their two daughters, Olive and Prairie.",
    "areas_of_focus": "Steven believes that life is serious… but not that serious… A big part of his life growing up was the outdoors and being active outdoors. This led Steven to pursue an education in outdoor sports and adventure, guiding and teaching. In university he took an Adventure guide diploma with an Interdisciplinary degree. This helped develop his appreciation for fitness and the realization of how crucial it is for people to be active. Steven has been teaching and guiding since 2011, with his main area of focus being paddling and cross-country skiing. Anything from white water kayaking to canoe expeditions, stand up paddle boarding and coaching a cross-country ski race program. Steven works with people from all different walks of life, different ages, and ability levels. Athletes who are competitive, groups with special needs and everyday people who want to improve their life through active living and basic lifestyle practices., Functional fitness became a part of Stevens life during university, and it has been a huge part ever since. He has benefited greatly from training and the exploration of physical expression and is passionate to share that with others. Steven has developed his coaching and teaching to include a breadth of fitness pedagogy, and is always learning and improving upon his teaching and coaching. Steven genuinely believes in challenging oneself and the pursuit of living a large life. He promotes simple lifestyle guidelines but just because they are simple does not mean they are easy. Steven wants to help people become autonomous, free movers, increasing individual’s capabilities to take control of their health and well being and move them towards vitality.",
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://www.instagram.com/tothewoodstrainingco/?hl=en",
      "https://tothewoodstraining.ca/"
    ]
  },
  {
    "id": "calgary-royal-oak-raymond-nagapoosonam",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Raymond Nagapoosonam",
    "trainerNumber": 18,
    "name": "Raymond Nagapoosonam",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/xxx.jpg",
    "bio": "Raymond completed his 2200 hour Massage Therapy diploma from Mount Royal University in 2019. He’s always been very passionate about what he does. Mostly taken by his interest in the treatment of depression and anxiety, he found massage to be a great outlet as a form of self-love.\nThrough experiences with yoga, hiking, and consistency with going to the gym, Raymond has learned exceptional methods of encouraging the mind-body connection. His understanding of these principles allows for great support and resilience through healing.\nRaymond has been treating a number of conditions that involve trauma and injuries; whiplash, headaches, tendonitis, frozen shoulder, and chronic low back pain. While also working on those achy head,neck, and shoulders relaxation is a key component to relieving stress. Through providing treatment via fascial work, deep tissue, hand and foot reflexology, prenatal, postnatal, somatic work, and trigger point release. Raymond can surely provide you with exactly what you need.",
    "areas_of_focus": "Relaxation Massage, Therapeutic Deep Tissue Massage, Myofascial Release, Dynamic Cupping, TMJ Massage",
    "certification": "2200-Hour Massage Therapy Program 2019, 800-Hour Core Massage Program National Holistic Institute 2022",
    "email": null,
    "phone": null,
    "social_links": [
      "https://www.instagram.com/raymondnaga/",
      "https://strengthsanctuaryandmassage.janeapp.com/"
    ]
  },
  {
    "id": "calgary-royal-oak-gerald-cortez",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Gerald Cortez",
    "trainerNumber": 19,
    "name": "Gerald Cortez",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Gerald-Cortez.jpg",
    "bio": "Gerald, Arnelia’s husband and business partner, started his massage training in the Philippines in 2004. He continued to work as a massage therapist with Arnelia in Athens, Greece for 5 years. When he moved to Canada in 2014, Gerald finished his Massage Therapy Program with more than 2250 hours.\nGerald embraces the challenge of treating people with acute and chronic conditions and helping them to heal. He specializes in injury/trauma assessment. His treatments include advanced techniques for all conditions, injuries and rehabilitation therapy",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://cortezmassage.ca/",
      "https://www.instagram.com/corteznaturalhealing/"
    ]
  },
  {
    "id": "calgary-royal-oak-laura",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Laura",
    "trainerNumber": 20,
    "name": "Laura",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Laura.jpg",
    "bio": null,
    "areas_of_focus": "I have been doing personal training and teaching group fitness classes for the past 15 years. My areas of focus are functional fitness, Crossfit, as well as general strength and conditioning. I work with all ages and levels from experienced athletes to those new to the gym, Functional Fitness, Crossfit, General Strength and Conditioning",
    "certification": "Bachelor of Arts, Bachelor of Education, Crossfit Level 1 and 2 Certification",
    "email": "macdonaldpt25@gmail.com",
    "phone": "403-651-4497",
    "social_links": []
  },
  {
    "id": "calgary-royal-oak-kartick-mishra",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Kartick Mishra",
    "trainerNumber": 21,
    "name": "Kartick Mishra",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Katick.jpg",
    "bio": "Kartick is a Certified Personal Trainer from the National Academy of Sports Medicine (NASM), USA. Kartick is a passionate and motivated\nPersonal Trainer\nwho uses a combination of HIIT and metabolic training and stress management techniques to improve clients’ physical and mental capabilities.\nKartick’s mission is to help people feel fit, healthy, confident, and, most of all, happy. He specialized in preparing bodybuilders for competition, strength and power development, sport-specific training, fat loss, hypertrophy training, body transformation, and injury prevention as well as balance, mobilization, and stabilization techniques. He trained numerous clients of different age groups and different nationalities for the last 8-plus years.\nHe himself trained with legendary bodybuilder and Mr. Olympia competitor known as God Father of Bodybuilding\nCharles Glass\nat Gold’s Gym in Venice, California, USA, and learned several techniques on “How To Build Your Body”.",
    "areas_of_focus": "fat loss, transformation, muscle building, strength & conditioning training (HIIT), body balancing and flexibility exercises., Sports-specific training",
    "certification": "Certified Personal Trainer from the National Academy of Sports Medicine",
    "email": null,
    "phone": "647-236-1227",
    "social_links": []
  },
  {
    "id": "calgary-royal-oak-dynamic-yyc",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Dynamic YYC",
    "trainerNumber": 22,
    "name": "Dynamic YYC",
    "role": null,
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Dynamic-YYC.jpg",
    "bio": "Dynamic YYC is a multidisciplinary clinic offering Physiotherapy, Chiropractic care, and Massage Therapy. We specialize in treating and preventing injuries, improving mobility and technique, providing actionable information, and helping clients get closer to their health goals.",
    "areas_of_focus": "Physiotherapy, Massage Therapy, Chiropractic Care",
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://www.dynamicyyc.com/",
      "https://www.instagram.com/dynamicyyc/"
    ]
  },
  {
    "id": "calgary-royal-oak-haley-daniel",
    "location": "CALGARY ROYAL OAK",
    "trainerName": "Haley Daniel",
    "trainerNumber": 23,
    "name": "Haley Daniel",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/royaloak_trainers/Haley-Daniel.jpg",
    "bio": "With a passion for fitness and mental health, I offer personalized training programs that promote both physical and mental well-being. As a personal trainer and mental health nurse, I understand the importance of developing a healthy relationship with exercise and your body. My tailored techniques help clients achieve their fitness goals and foster a positive mindset, which, in my experience, is the key to long-term success. Whether you’re looking to learn new skills in the gym, change your body composition, improve your relationship with yourself, or just feel better, I provide engaging online programming and in-person sessions for all fitness levels and interests. Reach out today to start building the mind, body, and habits you’ve always wanted!",
    "areas_of_focus": "Weight Loss, Strength/Muscle Gain, Injury Rehabilitation, Mental Health and Wellbeing",
    "certification": "Bachelor of Science in Nursing (Registered Nurse), McMaster University, Cognitive Behavioral Therapy Certification, Wilfrid Laurier University",
    "email": "haleyvdaniel@gmail.com",
    "phone": null,
    "social_links": ["http://www.without-limits.online"]
  }
]
