[
  {
    "id": "edmonton-south-lindsay-macdonald",
    "location": "EDMONTON SOUTH",
    "trainerName": "Lindsay Macdonald",
    "trainerNumber": 1,
    "name": "Lindsay Macdonald",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/fxcvs.jpg",
    "bio": "Lindsay’s passion for health and athletics has been lifelong. She knows firsthand how frustrating an injury can be, especially when it takes you away from what you love to do. Whether its your sport, job or hobby, she is invested in developing individual treatment plans, to problem solve current issues and better clients future health, through Therapeutic Massage and Remedial Exercise. She is proficient in many forms of therapeutic massage such as: swedish, deep tissue, Prenatal, Lymphatic drainage, Trigger point, Pre and Post Event Sport, Myofascial Release, Cupping, Joint and Soft tissue mobilizations.\nLindsay is working towards specializing in the neuromyofascial network of the body, currently offering movement based therapies such as: Fascial Stretch Therapy ( Level 1) and RAPID neurofascial reset ( Upper body series). Lindsay believes that treating the fascia and nervous system not only addresses the area of complaint, but often has a global system effect. Leaving clients with great, lasting results, and feeling like the best version of themselves!\nEducation\nLindsay, graduated from the MH Vicars School of Massage Therapy with a 2200 hour diploma in Registered Massage Therapy in 2015. Before becoming a massage therapist, Lindsay earned a Bachelor of Science Degree in Kinesiology at Brock University. During her studies she also competed as a Varsity Athlete on the Brock Amateur Wrestling Team, wrestling both at the National and International Level. Adding to her practice, Lindsay has completed courses in MyoFascial Cupping, Stretch to Win Fascial Stretch Therapy and RAPID neurofascial reset.\nCareer\nLindsay discovered her interest in the human body, particularly its amazing ability to adapt, heal and rebuild while experiencing a variety of soft tissue injuries to herself and her teammates during her athletic career. Lindsay was driven to become a therapist who utilizes a variety of massage therapy techniques to maximize the bodies potential to function efficiently and effectively in sport. Throughout her journey Lindsay has developed a special interest in Fascia and the Nervous System and their role in movement. Through hands on experience and continued education, Lindsay has developed her own unique treatment style. Although her treatments are beneficial for athletes, she has also had great success treating ANY client who wants to MOVE , but its limited by pain or restriction.\nProfessional Achievements\nLindsay is an active member of the Massage Therapist Association of Alberta (MTAA). She has been a successful therapist in a variety of physiotherapy clinics in both Edmonton and Fort Saskatchewan, Alberta. Lindsay has added to her practice by completing courses in MyoFascial Cupping, Stretch to Win Fascial Stretch Therapy and RAPID neurofascial reset and looks forward to taking further classes to specialize in these areas.\nOutside the clinic, Lindsay has spent time volunteering at several sporting events providing Pre and Post event Massage and Mobility. Including being the therapist for a group of athletes at the Olympic trials for Wrestling in 2016, in Sherwood Park, AB.",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://alleviatemassagetherapy.janeapp.com/#/staff_member/13"
    ]
  },
  {
    "id": "edmonton-south-lorelei-maher",
    "location": "EDMONTON SOUTH",
    "trainerName": "Lorelei Maher",
    "trainerNumber": 2,
    "name": "Lorelei Maher",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/dsadsa-2.jpg",
    "bio": "Fitness for me has always been about finding a way to make it feel enjoyable and maintainable. I graduated from college as a Personal Trainer in 2012 on a mission to make fitness fulfilling for everybody. I recognize that individuals are uniquely capable and my goal is that my clients can find empowerment by connecting with their strengths in a style that fits them best. I want to shift the focus of fitness in a direction that combats barriers to access and benefits overall quality of life.",
    "areas_of_focus": "Corrective Exercise, Chronic Conditions, Special Populations, Disabilities and Women’s Health",
    "certification": "CSEP CPT, NASM CES",
    "email": "loreleimaher@gmail.com",
    "phone": "780-707-8472",
    "social_links": []
  },
  {
    "id": "edmonton-south-alicia-harvey",
    "location": "EDMONTON SOUTH",
    "trainerName": "Alicia Harvey",
    "trainerNumber": 3,
    "name": "Alicia Harvey",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Alicia-Harvey-1.jpg",
    "bio": "Alicia believes that massage therapy is a safe and effective form of healthcare, which facilitates the body’s recovery from numerous ailments. She provides Myofascial Cupping Therapy, is experienced in performing intra-oral massage for those patients suffering from Temporomandibular Joint Disorder (TMJD), and treats women during and after pregnancy. Alicia is passionate about educating her clients and giving them the tools and support necessary to achieve lasting results and improve their well-being.\nEducation\nAlicia graduated from the West Coast College of Massage Therapy in New Westminster, BC, where she completed the 3000 hour RMT program. Many of these hours were spent gaining practical experience in a variety of settings. Alicia earned a Bachelor of Health Science Degree from Thompson Rivers University while practicing as a Massage Therapist.\nCareer\nAlicia has gained experience working in multiple settings since becoming a Registered Massage Therapist in 2011. Practicing in a multidisciplinary clinical setting, a spa setting, and a massage therapy clinical setting has provided her with the ability to work with a diverse clientele, as well as alongside other healthcare professionals.\nProfessional Achievements\nAlicia is a member of the Massage Therapist Association of Alberta (MTAA), and maintains registration as an inactive member with the College of Massage Therapists of British Columbia (CMTBC).",
    "areas_of_focus": null,
    "certification": null,
    "email": null,
    "phone": null,
    "social_links": [
      "https://alleviatemassagetherapy.janeapp.com/#/staff_member/10"
    ]
  },
  {
    "id": "edmonton-south-raylene-hugo",
    "location": "EDMONTON SOUTH",
    "trainerName": "Raylene Hugo",
    "trainerNumber": 4,
    "name": "Raylene Hugo",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Raylene.jpg",
    "bio": "Raylene graduated from the South Edmonton School Of Massage Therapy in 2015, successfully completing a 2200 hour program. Throughout the years she has broadened her scope of practice to include cupping, gua sha, trigger point therapy, hydrotherapy, muscle energy technique and reiki. Within her practice Raylene’s biggest focus has always been to create a health and wellness goal with each individual client to suit their needs and wants. With using many different techniques and modalities she can help the client live a better quality of life by minimizing chronic pain and preventing future acute pain and injury. Raylene loves to see all types of clients from pregnancy massage to deep tissue massage and is always up for a good challenge! In the past years she has also diversified her clientele to include horses. When she is not in the office working you can find Raylene out on her acreage gardening, riding horses and fishing!",
    "areas_of_focus": null,
    "certification": null,
    "email": "raylenefhugo@gmail.com",
    "phone": "780-819-0771",
    "social_links": ["https://www.instagram.com/bozleantherapeutics_yeg/"]
  },
  {
    "id": "edmonton-south-dr-william-farrel",
    "location": "EDMONTON SOUTH",
    "trainerName": "Dr. William Farrel",
    "trainerNumber": 5,
    "name": "Dr. William Farrel",
    "role": "Chiropractor",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Dr.-William-Farrel.jpg",
    "bio": "Dr. Farrell has been in professional practice since 2008 and has worked in both Australia and Canada since 2013. As life long learner, he is constantly adding new skills sets to blend in with his treatments to help bring a result where a standard manual therapy approach alone may not have been successful. Dr. Farrell worked as a massage therapist for four years while doing his chiropractic training in Australia and uses soft tissue techniques regularly. He also holds an acupuncture license.",
    "areas_of_focus": "Dr. Farrell takes a special interest in complex musculoskeletal presentations involving lower back pain, neck pain unresponsive to treatment, TMJ pain, vestibular problems, and concussion rehabilitation.",
    "certification": "BSc., M.Chiro, DACNB, ACC",
    "email": "radixpain@gmail.com",
    "phone": "780-966-3876",
    "social_links": ["http://www.radixpain.ca"]
  },
  {
    "id": "edmonton-south-bailey-lau",
    "location": "EDMONTON SOUTH",
    "trainerName": "Bailey Lau",
    "trainerNumber": 6,
    "name": "Bailey Lau",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Bailey.jpg",
    "bio": "I have been involved in sports and performance-based activities since I was a child and progressed into personal training following my soccer career in university. I help clients with performance-based goals by providing a positive environment to grow and develop. My aim is to create and help develop body positive women that enjoy an active and healthy lifestyle. I am continuing to learn and keep up with the advancing training techniques while introducing those ideas to clients",
    "areas_of_focus": "Helping newcomers and women gain confidence in the gym, Guide women to a healthy lifestyle, Strength and conditioning training, Body re-composition",
    "certification": "Bsc. Physical Education and Kinesiology, First aid CPR",
    "email": "baileylau@aloudfitness.ca",
    "phone": "403-505-6840",
    "social_links": ["https://www.instagram.com/baileylaufit/"]
  },
  {
    "id": "edmonton-south-angela-das",
    "location": "EDMONTON SOUTH",
    "trainerName": "Angela Das",
    "trainerNumber": 7,
    "name": "Angela Das",
    "role": "Psychologist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Angela-Das.jpg",
    "bio": "Angela Das is a registered psychologist with the province of Alberta.  She graduated from Athabasca University with her Masters in Counselling in 2016.  She has worked in a wide variety of settings including non for profits, both elementary and secondary highschools, seniors associations, and now private practice.  These different locations gave her a breadth of different client demographics and cultures to work with.  Angela also has a special interest in Sport Psychology and performance, which pairs with her personal experience in both team and individual sport.\nAngela welcomes all ages in her practice and can address a wide variety of concerns.  She works with individuals, couples and families.  Angela now offers both in-person and online sessions.  Her therapy style can be described as eclectic as she pulls techniques from several different modalities in order to fit each individual client’s unique needs.  She is person-centered, which provides a teammate approach to counselling goals.  She strives to help her clients reach an overall higher potential by encouraging each person to see his/her/their own strengths and abilities.  Angela believes in better accessibility and offers sliding scale to those without insurance.",
    "areas_of_focus": null,
    "certification": null,
    "email": "info.ironpsych@gmail.com",
    "phone": "780-800-4435",
    "social_links": []
  },
  {
    "id": "edmonton-south-vicky-mccray",
    "location": "EDMONTON SOUTH",
    "trainerName": "Vicky McCray",
    "trainerNumber": 8,
    "name": "Vicky McCray",
    "role": "Certified Athletic Therapist, Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Vicky.jpg",
    "bio": "I have a passion for providing rehabilitation, nutrition, and fitness programs. Including nutrition in your recovery and performance helps make your fitness and recovery goals more attainable. When I am not at NSAT, I am working as a Sports and Fitness instructor with the Military forces. Working with both elite athletes and the general public has allowed me to develop successful treatment programs to restore, maintain and improve physical functioning, alleviate pain, and prevent injuries.",
    "areas_of_focus": "Manual Therapy and Active Rehabilitation, Functional Movement Screening, Concussion Screening, Joint mobilization Techniques, Individual and Group Nutrition Coaching, Pre and Postnatal Fitness and Rehabilitation",
    "certification": "Certified Athletic Therapist CAT(C), BSc. Kinesiology, BSc. Human Nutrition, Fitness and Sport Military Instructor Certification, Pre and Postnatal Fitness Specialist Certification",
    "email": null,
    "phone": "780-221-5058",
    "social_links": ["https://www.instagram.com/victorious.therapy/"]
  },
  {
    "id": "edmonton-south-rhiannon-sarah-mcleod",
    "location": "EDMONTON SOUTH",
    "trainerName": "Rhiannon Sarah McLeod",
    "trainerNumber": 9,
    "name": "Rhiannon Sarah McLeod",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Sarah.jpg",
    "bio": "Growing up very active, I played hockey for close to 10 years, up until teenage-hood. I left behind sports to pursue other passions during which I started my own photography business. Leaving behind all my physical activity I went through many up’s and down’s with my body image and health over the years that followed. Eventually I decided to commit to change, the process and the time it takes. I worked for a year on my own fitness at home, during which I lost 30 pounds. I fell in love with building muscle and strength, my acne cleared up, and I didn’t get sick anymore. Once I hit my one year fitness milestone I discovered Olympic Weightlifting and an obsession for barbells was born. My favourite part of being a trainer is that it allows me to share my knowledge and help people improve. My role is to teach you and do myself out of a job as you gain the skills and experience you need to succeed.",
    "areas_of_focus": null,
    "certification": "PTS – CANFIT PRO, DTS LEVEL 1, DR. SARAH DUVALL – PREGNANCY & POSTPARTUM COACHING, CPR LEVEL C & AED",
    "email": "rhiannonsmcleod@gmail.com",
    "phone": null,
    "social_links": [
      "https://www.instagram.com/rhiannonsarahm/",
      "http://www.RhiannonSAthletics.com"
    ]
  },
  {
    "id": "edmonton-south-melissa-chatigny",
    "location": "EDMONTON SOUTH",
    "trainerName": "Melissa Chatigny",
    "trainerNumber": 10,
    "name": "Melissa Chatigny",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Melissa-Chatigny.jpg",
    "bio": "I focus primarily on nutrition for athletes but also for general population with a focus on hormones and metabolism, weight loss and performance\nOlympic weightlifting, strength and conditioning for sports, team training and personal training\nI have been in the industry for 15 years as a Coach and a competitive athlete, I have a big passion for nutrition and changing the narrative around food and sports. I train harder than anyone in the room and I also have the most fun in my sessions.. that’s what you can expect working with me; hard work with lots of laughter.",
    "areas_of_focus": null,
    "certification": "M2 Performance Nutrition certified, NCCP certified, Crossfit Level 1,2",
    "email": "Melissa.chatigny@gmail.com",
    "phone": null,
    "social_links": ["https://www.instagram.com/melissachatigny/"]
  },
  {
    "id": "edmonton-south-ismaeel-elhakim",
    "location": "EDMONTON SOUTH",
    "trainerName": "Ismaeel El-Hakim",
    "trainerNumber": 11,
    "name": "Ismaeel El-Hakim",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Ismaeel-El-Hakim-1.jpg",
    "bio": "I am an NSCA Certified Personal Trainer with a long athletic history ranging from soccer to rugby and football. When injuries cut my playing time down, I found an outlet through weight training and competing in powerlifting competitions.\nMy area of competence lies in helping clients build muscle and/or lose fat, all while creating a positive gym experience for my clients. As a current BSc Psychology major, I understand the short- and long-term mental health benefits of participating in an exercise program and I hope to help my clients reap those benefits to their fullest potential.",
    "areas_of_focus": "Body composition, hypertrophy, powerlifting, and strength development.",
    "certification": "National Strength and Conditioning Association",
    "email": "ismaeel@catalyst-coaching.info",
    "phone": "780-718-2604",
    "social_links": [
      "https://www.instagram.com/ismaeelelhakim/",
      "https://www.catalyst-coaching.info%20"
    ]
  },
  {
    "id": "edmonton-south-chris-liddle",
    "location": "EDMONTON SOUTH",
    "trainerName": "Chris Liddle",
    "trainerNumber": 12,
    "name": "Chris Liddle",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Chris.jpg",
    "bio": "I specialize in helping people feel and look strong, gain confidence and live fulfilling, healthy lives.\nI’d best describe myself as a lifestyle personal trainer. I want to be someone who uses language you can understand, while teaching you and providing value. I want to be someone you can relate to who can guide you towards positive outcomes. When you work with me I want to see you reach your goals inside and outside of the gym. Whether that be longer hikes, a promotion at work, or guiding you on the journey of growing old with the people you love.\nI host a podcast called The Lifestyle Chase which is a great way for you to get to know me before reaching out. You can even learn about a few other trainers in the community (and this facility) as well as some business owners and inspiring people as well as across North America and beyond.\nI work with clients internationally as a coach with A-Team Fitness and I also offer that same level of service to anyone I work with locally under my own brand.\nFor years it has been my mission to have a meaningful role in making other people’s lives more abundant.\nI am an open book and very transparent. If you have any questions about me, or want to ask me a skill-testing question, feel encouraged to connect.\nI offer complimentary consultations over a video call to make sure we’re the right fit and to get you clear on what it is I have to offer as your trainer.\nLooking forward to meeting you!",
    "areas_of_focus": "General Health and Longevity, Strength Training",
    "certification": "CFSC, PN",
    "email": "chris@invigoratetraining.com",
    "phone": "780-312-8315",
    "social_links": ["https://www.instagram.com/christianliddle/"]
  },
  {
    "id": "edmonton-south-avneesh-sharma",
    "location": "EDMONTON SOUTH",
    "trainerName": "Avneesh Sharma",
    "trainerNumber": 13,
    "name": "Avneesh Sharma",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Avneesh-Sharma.jpg",
    "bio": "My training style is geared to people of all levels, I focus on building strong fundamental technique,\nimproving heart rate, and reducing pain. I want my clients to use the discipline created in the gym, to\nincrease their “compete level’, thus performing at a higher level in their professional and personal lives.\nI have spent countless hours working with clients of all levels, the rewarding feeling of helping someone\nimprove their overall wellbeing is unmatched by anything else.",
    "areas_of_focus": "Strength & Conditioning, Pre/post-rehab, Kickboxing",
    "certification": "Ace certified personal trainer, Ace certified nutrition specialist, Canadian kickboxing level 1",
    "email": "Avneesh4@gmail.com",
    "phone": "780-994-7702",
    "social_links": [
      "http://www.foodguyavi.com",
      "https://www.instagram.com/foodguyavi/"
    ]
  },
  {
    "id": "edmonton-south-luke-bialobzyski",
    "location": "EDMONTON SOUTH",
    "trainerName": "Luke Bialobzyski",
    "trainerNumber": 14,
    "name": "Luke Bialobzyski",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Luke.jpg",
    "bio": "My name is Luke Bialobzyski, owner of Shift to Strength. I possess advanced knowledge of human anatomy, exercise physiology, behaviour change, and nutrition strategies to give my clients the best experience and results possible.\nI see myself both as your partner and coach. I take your fitness goals very personally, and through evidence-based, proven practices, we create lasting results together. I’m confident in my ability to help transform your life. All I need from you is a willingness to grow into the person you’ve always wanted to become.\nWhenever you’re ready to make the shift, I’m here.",
    "areas_of_focus": "Weight loss/management, Muscle growth, Strength development, Behaviour change/habit formation.",
    "certification": "NAIT Personal Fitness Trainer Diploma, CSEP CPT",
    "email": "info@shifttostrength.com",
    "phone": "780-619-3539",
    "social_links": [
      "http://www.shifttostrength.com",
      "https://www.instagram.com/luke_bialobzyski/"
    ]
  },
  {
    "id": "edmonton-south-sierra-rotchford",
    "location": "EDMONTON SOUTH",
    "trainerName": "Sierra Rotchford",
    "trainerNumber": 15,
    "name": "Sierra Rotchford",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Sierra.jpg",
    "bio": "During my career as an Edmonton paramedic, most patients I attended were suffering from lack of mobility, chronic pain, and preventable diseases. Transferring my knowledge and skills as an emergency medical professional to personal training is deeply valued by my clients; valuing proper body mechanics, identifying muscular misfire patterns, and instructing with tension-breaking humour is what I bring to the table.\nIt is my personal mission to equip all my clients with everything I’ve learned so they can outgrow me; from breaking barriers for consistent fitness in parenthood, to navigating fitness after injury or disease, and increasing both strength and muscle mass.",
    "areas_of_focus": "Strength & Body Recomposition, Injury Post-Rehabilitation",
    "certification": "NAIT Personal Fitness Trainer Diploma, CSEP CPT, ACE Certification, Primary Care Paramedic (PCP)",
    "email": "getstrong@closedcore.com",
    "phone": null,
    "social_links": [
      "http://www.closedcore.com",
      "https://www.instagram.com/closedcore/"
    ]
  },
  {
    "id": "edmonton-south-fraser-ehl",
    "location": "EDMONTON SOUTH",
    "trainerName": "Fraser Ehl",
    "trainerNumber": 16,
    "name": "Fraser Ehl",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/fraser-1.jpg",
    "bio": "I’m a Certified Strength and Conditioning Specialist with a Bachelor of Kinesiology from the University of Alberta and have been working as a Personal Trainer for several years. I started lifting almost 20 years ago with bodybuilding and moved into powerlifting as I got older. After a successful run where I held 4 National Records in 2 different federations I now focus on general strength training and living a fun and healthy lifestyle. I work with people of various skill levels and fifitness goals but always follow an approach based on thousands of hours of experience and education",
    "areas_of_focus": "Muscle Building, General Strength, Weight Loss, Rehab and Injury Prevention",
    "certification": "Bachelor of Kinesiology – U of A, Certified Strength and Conditioning Specialist – NSCA, Exercise Therapy Association Level 1 + 2",
    "email": "fraser.ehl.fitness@gmail.com",
    "phone": "780-850-9673",
    "social_links": ["https://www.instagram.com/fraser.ehl.fitness/"]
  },
  {
    "id": "edmonton-south-dr-carter-w-campbell",
    "location": "EDMONTON SOUTH",
    "trainerName": "Dr. Carter W. Campbell",
    "trainerNumber": 17,
    "name": "Dr. Carter W. Campbell",
    "role": "Chiropractor",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Carter-Campbell.jpg",
    "bio": "Dr. Campbell earned early acceptance into the Doctor of Chiropractic program at the University of Western States while enrolled in a Bachelor of Kinesiology program at the University of Alberta. With a background in human movement and a degree in human biology, you will see Dr. Campbell putting his skills to work on patients in the full training facilities available at the Radix Pain & Rehabilitation Centre. Dr. Campbell is a passionate people person and equally invested in helping patients accomplish their personal health and performance goals. Having undergone a personal health transformation himself some years ago, Dr. Campbell understands firsthand how difficult getting started can be and how frustrating injuries can be when they get in the way of training progress. Dr. Campbell enjoys working with a wide variety of patients from those with chronic pain, acute pain, or performance driven and spends his free time cooking, powerlifting, golfing, and various winter sports.",
    "areas_of_focus": "Back pain, neck pain, shoulder pain, hip pain, knee pain, ankle pain, and improving performance.",
    "certification": "Doctor of Chiropractic",
    "email": "Radixpain@gmail.com",
    "phone": "780-966-3876",
    "social_links": ["http://www.radixpain.ca"]
  },
  {
    "id": "edmonton-south-byrin-wylie",
    "location": "EDMONTON SOUTH",
    "trainerName": "Byrin Wylie",
    "trainerNumber": 18,
    "name": "Byrin Wylie",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Byrin.jpg",
    "bio": "I have been involved in powerlifting since 2012, and am an advocate for general strength building to help individuals reach their health and fitness goals. By combining both bodybuilding and powerlifting-style modalities in my programs, my clients can expect to get strong through a variety of exercises and movements while building muscle at the same time. I am extremely grateful to work with clients of all levels who wish to better themselves physically and mentally through the pursuit of strength. Even when setbacks occur, I’m of the mindset of chasing progress and will do whatever it takes to help you keep moving forward towards your goals. My powerlifting athletes benefit from having a coach who is extremely active within the sport. I started training for powerlifting in 2012 after trying my hand in bodybuilding, and have been competing in the IPF / CPU since 2013. I have competed as high as the national level, have extensive experience in competition handling & volunteering, and I am continually looking to increase my knowledge in all things strength and health related to better serve my athletes.",
    "areas_of_focus": "Powerlifting, General Strength Training, Hypertrophy",
    "certification": "CanFit Pro PTS, CPU Coaching Certificate",
    "email": "wyliestrength@gmail.com",
    "phone": "780-293-1075",
    "social_links": ["https://www.instagram.com/byrinw/"]
  },
  {
    "id": "edmonton-south-andrew-coates",
    "location": "EDMONTON SOUTH",
    "trainerName": "Andrew Coates",
    "trainerNumber": 19,
    "name": "Andrew Coates",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Andrew-Coates.jpg",
    "bio": "I work with the everyday person who wants to be stronger and healthier, feel confident and comfortable in a gym. I hope to set people up with the skills to be independent and enjoy a life of physical activity. I enjoy educating other coaches and the general public about fitness through my various media outlets.\nI’ve trained over 20,000 hours with clients and now work in-person and online. In addition to my coaching work, I write for fitness industry publications including T-Nation, Muscle and Fitness Magazine, Generation Iron, The Personal Trainer Development Centre, and BarBend. I’m the host of The Lift Free and Diet Hard Podcast. I speak/present at fitness industry conferences across North America.",
    "areas_of_focus": "Strength training, Generation population of all skill levels,, Older adults",
    "certification": "B Comm (Hons) Memorial University of Newfoundland, CPT, PN Lv 1",
    "email": "andrewcoatesfitness@gmail.com",
    "phone": null,
    "social_links": [
      "http://www.andrewcoatesfitness.com",
      "https://www.instagram.com/andrewcoatesfitness/"
    ]
  },
  {
    "id": "edmonton-south-sonya-palahicky",
    "location": "EDMONTON SOUTH",
    "trainerName": "Sonya Palahicky",
    "trainerNumber": 20,
    "name": "Sonya Palahicky",
    "role": "Massage Therapist",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/vdsvs.jpg",
    "bio": "I am fascinated by the human body and how the combination of physical and mental wellbeing can affect the greater whole; I truly enjoy working with clients through the intake, assessment and treatment process to ensure a customized therapeutic treatment.\nI am a registered member with the Massage Therapist Association of Alberta (MTAA), ready to assist your needs with a commitment and knowledge to help reach your personal goals. Outside of massage, I am also passionate about meditation, yoga, biking, muay thai boxing, and travel.",
    "areas_of_focus": null,
    "certification": "In 2010, looking for a life change, I began my training in Thai massage therapy in Thailand. I completed the program, as recognized by the Government of Thailand in 2013 with a certification to also teach Thai Massage Therapy. In addition, I acquired training in aromatherapy, reflexology, and herbal compress., Constantly in pursuit of self-development, I completed my Registered Massage Therapy diploma at MH Vicars School of Massage Therapy in 2015. Since then I have added kinesio taping and cupping to my treatment offerings.",
    "email": null,
    "phone": null,
    "social_links": [
      "https://alleviatemassagetherapy.janeapp.com/#/staff_member/1"
    ]
  },
  {
    "id": "edmonton-south-leah-cheung",
    "location": "EDMONTON SOUTH",
    "trainerName": "Leah Cheung",
    "trainerNumber": 21,
    "name": "Leah Cheung",
    "role": "Dietitian",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Leah-Cheung-1.jpg",
    "bio": "Leah Cheung is a Registered Dietitian with the College of Dietitians of Alberta. She holds Bachelor of Science degrees with Distinction in both Nutrition and Psychology from the University of Alberta.\nWith a background in disordered eating, Leah has a passion for intuitive eating and helping people create healthier relationships with food. Eating should be a source of pleasure and not a source of guilt, shame, or punishment. If you are struggling with preoccupation with food, food fears, weight fluctuations, binge eating, or diet burnout, it’s time to try a new approach. Leah can help you make peace with food and eating and gain freedom from restrictive food rules.\nLeah also works extensively with athletes and the general active population to help achieve lifestyle and fitness goals. Gain insight regarding macronutrient distributions, caloric goals, meal timing, and supplement use to maximize your potential in and out of the gym.\nThrough one-on-one sessions, Leah will break down the complicated world of nutrition and make food one of your greatest allies!",
    "areas_of_focus": null,
    "certification": null,
    "email": "intoitnutrition@gmail.com",
    "phone": "780-660-6271",
    "social_links": []
  },
  {
    "id": "edmonton-south-kevin-zimmerman",
    "location": "EDMONTON SOUTH",
    "trainerName": "Kevin Zimmerman",
    "trainerNumber": 22,
    "name": "Kevin Zimmerman",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Kevin-Zimmerman-1_db4e719b9557fbf254474f8af3deaebe.jpg",
    "bio": "My involvement in Olympic weightlifting began in 1972. I have an extensive background as an athlete, coach, administrator and official in the sport since that time. I have been the head coach of the Olympic Power and Fitness weightlifting club since 2005. During that time, I have developed athletes to successfully compete at the Western Canadian Championships as well as Junior and Senior Canadian Championships. Also during that time, I have been one of the coaches for Team Alberta for many of these competitions and have coached athletes to become national champions.\nI have worked extensively with athletes at all levels from novice to elite and always enjoy seeing the progress that they all make at whatever level they are training at. It is always exciting to see athletes become stronger and more proficient in the lifts and the satisfaction they feel from their training. My focus is on teaching proper movement patterns to ensure that athletes are completing all lifts and assistance exercises in safe and efficient patterns.  I have worked with competitive weightlifters as well as athletes from other sports using the lifts to gain strength and power for their sport. The skills learned through this training are extremely functional and carry over very well to any other sport that requires speed, flexibility and power.",
    "areas_of_focus": null,
    "certification": null,
    "email": "kjzimm2@gmail.com",
    "phone": "780-893-1220",
    "social_links": []
  },
  {
    "id": "edmonton-south-rachelle-mcgillivray",
    "location": "EDMONTON SOUTH",
    "trainerName": "Rachelle McGillivray",
    "trainerNumber": 23,
    "name": "Rachelle McGillivray",
    "role": "Personal Trainer",
    "image": "https://evolve-strength.tor1.cdn.digitaloceanspaces.com/assets/images/All_Trainer_Images/south_trainers/Rachelle.jpg",
    "bio": "My name is Rachelle McGillivray. After reading every fitness magazine on the shelf and not finding enough information, it was time to enroll in school and chase my passion. In 2010 I graduated from N.A.I.T with a diploma as a personal fitness trainer. Finally, I cannot get enough personal development. Give me books, seminars, and equipment courses…let’s talk!\nIn these past 11 years I have been honing coaching my skills by working with a wide variety of people. I have worked with athletes, juniors to seniors, newbies to gym experts. I love to see people progress towards their goals. Whether that be playing with their grandchildren at the park, returning to work safely, or getting to that next level of sport.\nIf the term ‘functional’ hasn’t been overused, then that’s how I would generally describe my training style. I train in terms of movement patterns that you would use in your daily life. Squat to pick up dishes out of the dishwasher. Rotate to find a shelf. Overhead press to put the dishes on a high shelf. Sound familiar? But maybe its heavier yardwork? Or a golf ball you want to whack around the course? We have a life to live, and we need to be strong to live it, so we have some work to do. Not sure where to get started? I know where. If you have a goal let me help you reach it. I’ve got the knowledge, the tools and I’ve got your back.",
    "areas_of_focus": "Female Weight Loss, Female Body Recomposition, Female Strength Training",
    "certification": "CSEP-CPT, Titleist Performance Institute Level 1 and Level 2 Fitness, Bioforce Conditioning Certification, Agatsu Kettlebell certification, Functional Movement Screen certification, CSEP high performance Athlete module, ",
    "email": null,
    "phone": null,
    "social_links": []
  }
]
